hermeneus.org
# -*- mode: org; org-src-preserve-indentation: t; org-blank-before-new-entry: '((heading . t) (plain-list-item . auto)); eval: (progn (when (fboundp 'tina/org-insert-heading-after) (add-hook 'org-insert-heading-hook 'tina/org-insert-heading-after t t)) (when (and (fboundp 'tina/org-add-end-matter) (fboundp 'tina/org-babel-tangle-add-end-matter)) (add-hook 'org-babel-pre-tangle-hook 'tina/org-babel-tangle-add-end-matter nil t))) -*-

#+TITLE: Hermeneus

#+PROPERTY: header-args :results silent :tangle yes
#+PROPERTY: header-args:emacs-lisp :lexical t

* Early definitions
** Dependencies
:PROPERTIES:
:ID:       TKR:b4c7fe07-d157-4832-94c7-2be9bf65d6d9
:END:
#+begin_src emacs-lisp
(require 'eieio-core)
(require 'cl-preloaded)
(require 'eieio)
(require 'custom)
(require 'derived)

(eval-when-compile (require 'subr-x)
                   (require 'rx)
                   (require 'cl-macs))
#+end_src

** Constants
:PROPERTIES:
:ID:       TKR:476d569a-11f6-4c85-9c83-286ab6af8fec
:END:
#+begin_src emacs-lisp
(defconst hrm--greek-letters "αβγδεϝζηθιϳκλμνξοπρςτυφχψωΑΒΓΔΕϜΖΗΘΙͿΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ"
  "Every letter in the Greek alphabet, including the digamma and yot.")

(defconst hrm--greek-diacritics "\u0313\u0314\u0300\u0301\u0342\u0308\u0345\u0304\u0306"
  "Every combining diacritic relevant to Ancient Greek.")

(defconst hrm--greek-punctuation "’·;")

;; This isn’t actually used anywhere. I don’t remember why I made it.
;; But it’s nice, so it stays.
(defconst hrm--greek-letter-names
  (list "alpha"  "beta"   "gamma" "delta" "epsilon" "digamma" "zeta"
          "eta" "theta"    "iota"   "yot"   "kappa"  "lambda"   "mu"
           "nu"    "xi" "omicron"    "pi"     "rho"   "sigma"  "tau"
      "upsilon"   "phi"     "chi"   "psi"   "omega"))

(defconst hrm--greek-unicode-all
  (cl-loop for v being the hash-values of (ucs-names)
           for v = (char-to-string v)
           if (string-match-p (rx (category greek)) v)
           concat v))

(defconst hrm--lowercase-sigmas "σςϲͻͼͽ")
(defconst hrm--uppercase-sigmas "ΣϹϽϾϿ")

;; Oops! ALL sigmas
(defconst hrm--all-sigmas (concat hrm--lowercase-sigmas
                                  hrm--uppercase-sigmas)
  "Every sigma. All of them.
You need a lowercase word-ending sigma? Consider it done. How
about a capital reverse dotted lunate sigma? We’ve got you
covered. Is this madness, you ask? Madness? THIS IS SIGMA!")

(defconst hrm--git-lsj-dir
  "https://raw.githubusercontent.com/PerseusDL/lexica/master/CTS_XML_TEI/perseus/pdllex/grc/lsj/"
  "Location of the LSJ within the PerseusDL “lexica” repository.")
#+end_src

** Utility functions
:PROPERTIES:
:ID:       TKR:033a6ce1-0d17-431f-921d-75c4ed9bd8d9
:END:
#+begin_src emacs-lisp
(defun hrm-alist-to-local-vars (alist &optional prefix)
  "Convert each key in an alist to a local variable.
Each variable will have the name and value of the relevant key.
If PREFIX is a string, it will be added to the beginning of each
variable name (with a hyphen in between)."
  (let (rtn)
    (dolist (a alist (nreverse rtn))
      (let* ((var-sym (if (stringp prefix)
                          (intern (concat prefix "-" (symbol-name (car a))))
                        (car a)))
             (var (make-local-variable var-sym)))
        (set var (cdr a))
        (push var rtn)))))

(defun hrm--make-keyword (symbol)
  (make-symbol (concat ":" (symbol-name symbol))))
#+end_src

*** Get default value of class slot
:PROPERTIES:
:ID:       TKR:48d94516-5ea7-456d-b072-2666f4600d71
:END:
#+begin_src emacs-lisp
(defun hrm--get-slot-default-value (class slot)
  "Return the default value of SLOT in CLASS."
  (thread-first (cl-loop for slot in (eieio-class-slots class)
                         if (eq (cl--slot-descriptor-name slot) 'object-name)
                         return slot)
    (cl--slot-descriptor-initform)
    (eieio-default-eval-maybe)))
#+end_src

*** Which words have combining diacriticals that won’t… combine?
#+begin_src emacs-lisp :tangle no :results replace list :load no
(let (current-word)
  (lööp for i across (seq-copy hrm-greek-words-beta)
        if (string-match-p (rx (category combining-diacritic)) (setq current-word (hrm-beta-to-unicode i)))
        collect (message "%s ⇒ %s" i current-word)))
#+end_src

#+RESULTS:
- a)qw/|/wsis ⇒ ἀθῴ́ωσις
- *)ai/+das ⇒ ἈΪ́Δας
- *)ai/+dhs ⇒ ἈΪ́Δης
- a)lh/(ion ⇒ ἀλή̔ιον
- a)mfiqrw/|/skw ⇒ ἀμφιθρῴ́σκω
- a)natru\/ga/w ⇒ ἀνατρὺ́γάω
- a)nd=i/kths ⇒ ἀνδ͂ίκτης
- da+mosiofu/lakes ⇒ δα̈μοσιοφύλακες
- dafno=ghqh/s ⇒ δαφνο͂γηθής
- e)nagro/meno|s ⇒ ἐναγρόμενοͅς
- e)noiko=dome/w ⇒ ἐνοικο͂δομέω
- e)u)+krhmnos ⇒ ἐὐ̈κρημνος
- *)ia=puc ⇒ ἸΑ͂Πυξ
- polupu\/los ⇒ πολυπὺ́λος
- *)ra=ros ⇒ Ρ̓Α͂Ρος
- *)ra/rion ⇒ Ρ̓ΆΡιον
- w)|o=fage/w ⇒ ᾠο͂φαγέω

*** Trim a string
#+begin_src emacs-lisp
(defun hrm--trim-string-extra (string)
  "Trim a string more aggressively than the function ‘string-trim’.
Returns STRING, with whitespace and punctuation characters found
at each end removed."
  (let ((trim (rx (one-or-more (any blank punctuation ?\n)))))
    (string-trim string trim trim)))
#+end_src

** Options
:PROPERTIES:
:ID:       TKR:feba7f56-ff49-4ed3-9db0-f6602296810a
:END:
#+begin_src emacs-lisp
(defgroup hermeneus nil
  "Options for Hermeneus, the Ancient Greek word utility."
  :tag "Hermeneus"
  :group 'applications)

(defgroup hrm-faces nil
  "Faces used in Hermeneus, the Ancient Greek word utility."
  :tag "Hermeneus faces"
  :group 'hermeneus)
#+end_src

*** Hooks
:PROPERTIES:
:ID:       TKR:d47a2a83-a109-4534-927f-b93831bb9cbe
:END:
#+begin_src emacs-lisp
(defcustom hrm-scan-entry-functions nil
  "Functions called by ‘hrm-scan-xml’ for every XML element
in the lexicon. Each function is run with two arguments: the
word-object corresponding to the entry, and the DOM parsed
from the XML element itself."
  :type 'hook
  :group 'hermeneus)
#+end_src

** Modes
:PROPERTIES:
:ID:       TKR:e540ec29-199d-4eaa-86e5-fb355dd51938
:END:
#+begin_src emacs-lisp
(define-derived-mode hermeneus-mode special-mode "Hermeneus")
#+end_src

** Keys
:PROPERTIES:
:ID:       TKR:057b84a7-d596-45d7-ab34-ce9b509049a7
:END:
#+begin_src emacs-lisp
(define-key hermeneus-mode-map "g" 'hrm-buffer-update)
#+end_src

* Conversion
:PROPERTIES:
:ID:       TKR:a5c757b2-ff0f-4c62-957d-8d8dc8da62a1
:header-args:emacs-lisp: :tangle hrm-conv.el
:END:
This section exists for converting Latin letters representing Greek letters (i.e. “Beta code”) into proper, godly Greek Unicode characters.

Now, Beta code, as it exists in this program, takes two forms: the standard Beta code used by the XML LSJ, and a more personalized Beta code for the individual user. The latter mainly exists because I wanted to be able to look up Greek words in a Greek keyboard layout without having to switch from a QWERTY layout manually; but I realized that this approach (translating the QWERTY layout to the Greek layout) excludes those who use different keyboard layouts, which is why I made it fully customizable. (see option ~hrm-beta-input-type~) It’s a bit of a doozy to implement, requiring several utility functions and a loop in a custom definition, but well worth it for increasing the international utility of Hermeneus.

** Dependencies
:PROPERTIES:
:ID:       TKR:91c60345-0a80-4c03-8984-9a02ff01186d
:END:
#+begin_src emacs-lisp
(require 'cl-lib)
(require 'ucs-normalize)

(eval-when-compile
  (require 'rx)
  (require 'cl-macs)
  (require 'subr-x))
#+end_src

** Utility functions
#+begin_src emacs-lisp
(defun hrm--regexp-bracket-quote (string)
  "Return STRING, regexp-quoted and, if necessary, in square brackets.
This exists for when a regexp being generated may need to match
one character or more than one character, depending on the length
of input STRING."
  (if (> (length string) 1)
      (concat "[" (regexp-quote string) "]")
    (regexp-quote string)))
#+end_src

** Macros
#+begin_src emacs-lisp
(defmacro hrm--make-regexp-versions (def-form &rest string-vars)
  "Define regexp versions of a series of string variables.
Each string in STRING-VARS will be given a regexp version, suffixed
\"regexp\", which will match any character in the string.
DEF-FORM should be one of ‘defvar’, ‘defconst’, or ‘setq’."
  (declare (indent 1)
           (debug ([&or "defvar" "defconst" "setq"] &rest symbolp)))
  `(progn
     ,@(cl-loop for var in string-vars
              collect (list def-form (intern (concat (symbol-name var) "-regexp"))
                            (hrm--regexp-bracket-quote (symbol-value var))))))
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:c056d1e0-5c34-41de-89de-94d388c5285f
:END:
#+begin_src emacs-lisp
;; For comparison, here is ‘hrm--greek-letters’:
;; αβγδεϝζηθιϳκλμνξοπρςτυφχψωΑΒΓΔΕϜΖΗΘΙͿΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ
(defconst hrm--beta-letters--standard
  "abgdevzhqijklmncoprstufxywABGDEVZHQIJKLMNCOPRSTUFXYW")

(defvar hrm--beta-letters--user hrm--beta-letters--standard)

;; (defconst hrm--greek-kbd-letters
;;   "abgde`zhuiĳklmnjoprwtyfxcvABGDE~ZHUIĲKLMNJOPRWTYFXCV")

;; (defvar hrm--beta-letters--user hrm--beta-letters--standard)
;; (defvar hrm--beta-output-letters hrm--greek-letters)

;; For comparison, here are the non-combining versions of the
;; characters in ‘hrm--greek-diacritics’:
;; ᾿῾ `´῀¨ͺˉ˘
(defconst hrm--beta-diacritics
  ")(\\/=+|_^")

(defconst hrm--beta-punctuation
  "':;") ; "’·;"

(defconst hrm--beta-all--standard
  (concat hrm--beta-punctuation hrm--beta-diacritics hrm--beta-letters--standard))

(hrm--make-regexp-versions defconst
  hrm--beta-diacritics hrm--beta-punctuation
  hrm--beta-all--standard)

(defvar hrm--beta-all--user hrm--beta-all--standard)
(defvar hrm--beta-all--user-regexp
  (hrm--regexp-bracket-quote hrm--beta-all--user))

(defvar hrm--greek-all
  (concat hrm--greek-punctuation hrm--greek-diacritics
          (apply #'string
                 (delete-dups (append (string-to-list hrm--greek-letters)
                                      (string-to-list hrm--all-sigmas))))))
#+end_src

