hrm-conv.el
(require 'cl-lib)
(require 'ucs-normalize)

(eval-when-compile
  (require 'rx)
  (require 'cl-macs)
  (require 'subr-x))

(defun hrm--regexp-bracket-quote (string)
  "Return STRING, regexp-quoted and, if necessary, in square brackets.
This exists for when a regexp being generated may need to match
one character or more than one character, depending on the length
of input STRING."
  (if (> (length string) 1)
      (concat "[" (regexp-quote string) "]")
    (regexp-quote string)))

(defmacro hrm--make-regexp-versions (def-form &rest string-vars)
  "Define regexp versions of a series of string variables.
Each string in STRING-VARS will be given a regexp version, suffixed
\"regexp\", which will match any character in the string.
DEF-FORM should be one of ‘defvar’, ‘defconst’, or ‘setq’."
  (declare (indent 1)
           (debug ([&or "defvar" "defconst" "setq"] &rest symbolp)))
  `(progn
     ,@(cl-loop for var in string-vars
              collect (list def-form (intern (concat (symbol-name var) "-regexp"))
                            (hrm--regexp-bracket-quote (symbol-value var))))))

;; For comparison, here is ‘hrm--greek-letters’:
;; αβγδεϝζηθιϳκλμνξοπρςτυφχψωΑΒΓΔΕϜΖΗΘΙͿΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ
(defconst hrm--beta-letters--standard
  "abgdevzhqijklmncoprstufxywABGDEVZHQIJKLMNCOPRSTUFXYW")

(defvar hrm--beta-letters--user hrm--beta-letters--standard)

;; (defconst hrm--greek-kbd-letters
;;   "abgde`zhuiĳklmnjoprwtyfxcvABGDE~ZHUIĲKLMNJOPRWTYFXCV")

;; (defvar hrm--beta-letters--user hrm--beta-letters--standard)
;; (defvar hrm--beta-output-letters hrm--greek-letters)

;; For comparison, here are the non-combining versions of the
;; characters in ‘hrm--greek-diacritics’:
;; ᾿῾ `´῀¨ͺˉ˘
(defconst hrm--beta-diacritics
  ")(\\/=+|_^")

(defconst hrm--beta-punctuation
  "':;") ; "’·;"

(defconst hrm--beta-all--standard
  (concat hrm--beta-punctuation hrm--beta-diacritics hrm--beta-letters--standard))

(hrm--make-regexp-versions defconst
  hrm--beta-diacritics hrm--beta-punctuation
  hrm--beta-all--standard)

(defvar hrm--beta-all--user hrm--beta-all--standard)
(defvar hrm--beta-all--user-regexp
  (hrm--regexp-bracket-quote hrm--beta-all--user))

(defvar hrm--greek-all
  (concat hrm--greek-punctuation hrm--greek-diacritics
          (apply #'string
                 (delete-dups (append (string-to-list hrm--greek-letters)
                                      (string-to-list hrm--all-sigmas))))))
