hermeneus.org
** Options
#+begin_src emacs-lisp
(defun hrm--make-beta-hash-1 (input-letters output-letters hash)
  (when (stringp input-letters)
    (setq input-letters (mapcar #'char-to-string
                                (string-to-list input-letters))))
  (cl-loop for i in input-letters
           for o across output-letters
           if (eq (length i) 1)
           do (puthash (string-to-char i) o hash)
           else do (setq hash (hrm--make-beta-hash-1 i (make-string (length i) o) hash))
           finally return hash))

(cl-defun hrm--make-beta-hash (input-letters &optional
                                             (output-letters hrm--greek-letters)
                                             (hash (make-hash-table :size (length hrm--greek-letters)))
                                             &key
                                             (output-punctuation hrm--greek-punctuation)
                                             (output-diacritics hrm--greek-diacritics)
                                             (input-punctuation hrm--beta-punctuation)
                                             (input-diacritics hrm--beta-diacritics))
  "Make a hash table for translating INPUT-LETTERS to OUTPUT-LETTERS.
INPUT-LETTERS can be a string or a list of strings.
OUTPUT-LETTERS must be a string.

If INPUT-LETTERS is a string, then each letter in INPUT-LETTERS
will be used as a key in the resulting hash table, with the
corresponding letter in OUTPUT-LETTERS as the value.

If INPUT-LETTERS is a list of strings, then each character in
each string is interpreted as alternate keys for whichever
character has the positional index in OUTPUT-LETTERS that the
string has in INPUT-LETTERS (a many-to-one mapping). E.g., the
arguments '(\"ab\" \"c\" \"d\") and \"xyz\" would result in a
hash table mapping \"a\" to \"x\", \"b\" to \"x\", \"c\" to
\"y\", and \"d\" to \"z\".

Use HASH if you want to start from an existing hash-table rather
than make a new one."
  (setq hash (hrm--make-beta-hash-1 input-letters output-letters hash))
  (when (and input-punctuation input-diacritics output-punctuation output-diacritics)
    (cl-loop for i across (concat input-punctuation input-diacritics)
             for o across (concat output-punctuation output-diacritics)
             do (puthash i o hash)))
  hash)

(defvar hrm--beta-hash--standard (hrm--make-beta-hash hrm--beta-letters--standard))
(defvar hrm--beta-hash--user (copy-hash-table hrm--beta-hash--standard))

(cl-defun hrm-conv--set-beta-input-type (&optional sym (def hrm-beta-input-type f))
  "Setter function for the option `hrm-beta-input-type'."
  (unless sym
    (setq sym 'hrm-beta-input-type))

  (cond ((eq def 'beta)
         (setq hrm--beta-hash--user
               hrm--beta-hash--standard)
         (setq hrm--beta-letters--user
               hrm--beta-letters--standard))

        ;; Note that standard Greek keyboard layouts don’t have
        ;; a key for the digamma or yot; so, for the ‘greek-kbd’
        ;; setting, I kind of fudged things. The digamma is
        ;; moved to the backtick/tilde key, while the yot is
        ;; moved to ĳ. I don’t think many people have that key
        ;; on their keyboards, either, but as I can’t find a
        ;; single word in the LSJ that contains a yot, I think
        ;; it’s best to avoid clobbering potentially useful
        ;; inputs with it.
        ;; Once Hermeneus is sophisticated enough to need
        ;; support for typing a yot in Greek-keyboard style Beta
        ;; code, I will be happy to rethink this.
        ;; …And if you need that functionality, PLEASE take me
        ;; out to dinner.
        ;; —Tina
        ((eq def 'greek-kbd)
         (let ((greek-kbd-def
                '("a" "b" "g" "d" "e" "`"  "z" "h" "u" "i" "ĳ" "k" "l" "m"
                  "n" "j" "o" "p" "r" "sw" "t" "y" "f" "x" "c" "v"
                  "A" "B" "G" "D" "E" "~"  "Z" "H" "U" "I" "Ĳ" "K" "L" "M"
                  "N" "J" "O" "P" "R" "SW" "T" "Y" "F" "X" "C" "V")))
           (setq hrm--beta-hash--user
                 (hrm--make-beta-hash greek-kbd-def)
                 hrm--beta-letters-user
                 (apply #'concat greek-kbd-def))))

        ((and (listp def) (cl-every #'stringp def))
         (setq hrm--beta-hash--user
               (hrm--make-beta-hash def)
               hrm--beta-letters--user
               (apply #'concat def)))

        (t (error "Invalid definition for ‘hrm-beta-input-type’: %s" def)))

  (setq hrm--beta-all--user
        (concat hrm--beta-punctuation hrm--beta-diacritics hrm--beta-letters--user)
        hrm--beta-all--user-regexp
        (hrm--regexp-bracket-quote hrm--beta-all--user))

  ;; if definition is specified, set the variable itself
  (when f
    (set-default sym def)))

(defcustom hrm-beta-input-type 'beta
  "How to interpret Latin letters used to represent Greek words.
Only affects user input. The default is the standard “Beta code”
used for representing Greek words in Latin characters. “Greek
Keyboard” translates a standard QWERTY keyboard layout to a
standard Greek keyboard layout. Finally, with “Custom mapping,”
you can define your own style of Beta code. This is represented
with a list of strings, each corresponding to a Greek letter (use
the Customize interface to see which ones). Each string only
needs to be one character, but you can add more characters onto
the string if you want more than one key to enter the same
letter.

If setting this outside of Customize, be sure to run
‘hrm-conv--set-beta-input-type’ afterward."
  :type `(choice (const beta :tag "Beta code")
                 (const greek-kbd :tag "Greek keyboard")
                 (list :tag "Custom mapping"
                       ,@(cl-loop for cg across hrm--greek-letters
                                for cb across hrm--beta-letters--standard
                                for sg = (if (eq cg ?ς)
                                             "σ/ς"
                                           (concat "  " (char-to-string cg)))
                                for sb = (char-to-string cb)
                                collect (list 'string :tag sg :value sb))))
  :tag "Hermeneus — Beta code input type"
  :set 'hrm-conv--set-beta-input-type
  :group 'hermeneus)
#+end_src

** Convert by hash
This may have to be recoded in such a way as to allow peeking at the next letter, to see if there’s a word boundary, for the sake of sigma normalization. Also, I should be thinking about iota-subscript stuff right now. Eeeegh…
#+begin_src emacs-lisp
(defun hrm--convert-string-by-hash (string hash)
  "Return STRING, translated according to HASH.
  HASH should be a hash table where the keys are characters and the
  values are characters or strings."
  (cl-loop for l across string
           for o = (or (gethash l hash) l)
           concat (cl-etypecase o
                    (string o)
                    (character (char-to-string o)))))
#+end_src

