hermeneus.org
** Normalize diacritics
#+begin_src emacs-lisp
(defun hrm-conv--change-diacritics-placement (string)
  (let ((rx (rx (group "*")
                (group (one-or-more (any ")(/\\=+|—^")))
                (group letter))))
    (replace-regexp-in-string rx "\\1\\3\\2" string)))

(defun hrm-conv--dieresis-before-accent (string)
  (let ((rx (rx (group (any "/\\"))
                (group "+" ))))
    (replace-regexp-in-string rx "\\2\\1" string)))

(defun hrm-conv--capitalize-after-asterisk (string)
  "If STRING contains an asterisk, return STRING with no asterisk
and with the first letter after it capitalized. Otherwise, return
STRING. (This also happens when no letters appear anywhere
following the asterisk.)"
  (if-let ((astr-idx (string-match-p "\*" string))   ; “asterisk index”
           (capt-idx (string-match-p (rx word-start) ; where to capitalize
                                     string (1+ astr-idx))))
      (progn (setq string (concat (substring string 0 astr-idx)
                                  (substring string (1+ astr-idx) capt-idx)
                                  (char-to-string (upcase (elt string capt-idx)))
                                  (substring string (1+ capt-idx))))
             (hrm-conv--capitalize-after-asterisk string))
    string))

(defun hrm-conv--normalize-beta-diacritics (string)
  (thread-first string
    (hrm-conv--change-diacritics-placement)
    (hrm-conv--dieresis-before-accent)
    (hrm-conv--capitalize-after-asterisk)))
#+end_src

** Normalize sigmas
#+begin_src emacs-lisp
(defun hrm-conv--normalize-sigmas (string)
  "Returns a copy of STRING, but with sigmas normalized.
Sigmas which end a word will be replaced with “ς”, while other sigmas
will be replaced with “σ”."
  ;; This function used to look like this:
  ;;
  ;; (replace-regexp-in-string (rx "ς" (not word-boundary)) "σ" string))
  ;;
  ;; An elaborate rewrite was necessary because Emacs’s regexp engine
  ;; now sees “σ” and “ς” as equivalent, which confuses the hell out
  ;; of ‘replace-regexp-in-string’.
  (let ((max (length string))
        done i substrings sigma)
    (while (not done)
      (if-let ((sigma-idx (string-match-p "ς" string i)) ; the actual test
               (next-idx (1+ sigma-idx))
               (new-substring (substring string (or i 0) sigma-idx)))
          ;; sigma is present
          (progn
            (setq sigma
                  ;; does it end a word?
                  (if (or (and (eq next-idx max) (setq done t))
                          (not (eq (char-syntax (elt string next-idx)) ?w)))
                      "ς" ; yes
                    "σ")) ; no
            (setq substrings
                  (cons sigma (cons new-substring substrings)))
            (setq i next-idx))
        ;; no more sigmas
        (if (not i) ; ‘i’ will be nil if the string had no sigmas at all
            (setq done string)
          (push (substring string i max) substrings)
          (setq done t))))
    (if (stringp done)
        done
      (apply #'concat (nreverse substrings)))))
#+end_src

** Conversion
#+begin_src emacs-lisp
(defun hrm-beta-to-unicode (string &optional input-p match-p)
  "Return STRING converted from Beta code to Unicode.
INPUT-P is whether or not the string should be interpreted as
user input. (The difference is that user input should be read
according to the option ‘hrm-conv-beta-input-type’; otherwise, it
should be read as standard Beta code, as used in the XML LSJ.)
MATCH-P should be non-nil when converting a string to be used
solely for matching (like in the function ‘hrm--re-builder’), in
which case sigma normalization is unnecessary."
  (setq string
        (thread-first string
          (hrm-conv--normalize-beta-diacritics)
          (hrm--convert-string-by-hash (if input-p
                                           hrm--beta-hash--user
                                         hrm--beta-hash--standard))
          (ucs-normalize-NFC-string)))
  (if match-p
      string
    (hrm-conv--normalize-sigmas string)))
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:843a4901-0bf6-4c9e-a709-c79b0a4195bc
:END:
#+begin_src emacs-lisp
(provide 'hrm-conv)

  ;;; hrm-conv.el ends here
#+end_src

* Matching
:PROPERTIES:
:header-args:emacs-lisp: :tangle hrm-match.el
:END:

** Dependencies
#+begin_src emacs-lisp
(require 'ucs-normalize)

(eval-when-compile (require 'rx)
                   (require 'cl-macs)
                   (require 'subr-x))

(require 'hrm-conv)
#+end_src

** Variables
#+begin_src emacs-lisp
(hrm--make-regexp-versions defconst
  hrm--lowercase-sigmas hrm--uppercase-sigmas hrm--all-sigmas)
#+end_src

** Functions

*** Remove diacritics from Greek words
:PROPERTIES:
:ID:       TKR:36e58a64-4ada-426c-b9b8-cd7d76123bb2
:END:
#+begin_src emacs-lisp
(defun hrm-remove-diacritics (string)
  "Return STRING, but with all diacritics removed."
  (replace-regexp-in-string (rx (category combining-diacritic)) ""
                            (ucs-normalize-NFD-string string)))
#+end_src

** Hash tables
#+begin_src emacs-lisp
(defun hrm-normalize-greek-char (char)
  (thread-first char
    (char-to-string)
    (hrm-remove-diacritics)
    (string-to-char)))

(cl-defun hrm--get-letter-variants (char)
  (when (stringp char)
    (setq char (string-to-char char)))
  ;; if it’s a sigma, return all sigmas of that case
  (if (memq char (string-to-list hrm--all-sigmas))
      (if (memq char (string-to-list hrm--lowercase-sigmas))
          hrm--lowercase-sigmas
        hrm--uppercase-sigmas)
    ;; otherwise, look up variants in ‘hrm--greek-unicode-all’
    (cl-loop for c across hrm--greek-unicode-all
             if (eq (hrm-normalize-greek-char char)
                    (hrm-normalize-greek-char c))
             concat (char-to-string c))))

(defvar hrm--letter-variant-hash (make-hash-table :size (length hrm--greek-all)))
(defvar hrm--letter-variant-hash-case-folded (make-hash-table :size (length hrm--greek-all)))

(defun hrm--make-letter-variant-hashes ()
  (cl-loop with letters = (thread-first hrm--greek-letters
                            (concat hrm--all-sigmas)
                            (string-to-list)
                            (delete-dups))
           for l in letters
           for ld = (downcase l)
           for lu = (upcase l)
           for variants = (hrm--get-letter-variants l)
           for casefold-variants = (if (eq ld lu)
                                       variants
                                     (concat (hrm--get-letter-variants ld)
                                             (hrm--get-letter-variants lu)))
           do (puthash l (hrm--regexp-bracket-quote variants)
                       hrm--letter-variant-hash)
              (puthash l (hrm--regexp-bracket-quote casefold-variants)
                       hrm--letter-variant-hash-case-folded)))

(hrm--make-letter-variant-hashes)

(defvar hrm--case-fold-hash (make-hash-table :size (length hrm--greek-unicode-all)))

(defun hrm--make-case-fold-hash ()
  (cl-loop for l across hrm--greek-unicode-all
           for lu = (upcase l)
           for ld = (downcase l)
           if (memq l (string-to-list hrm--all-sigmas))
           do (puthash l hrm--all-sigmas-regexp hrm--case-fold-hash)
           else if (eq ld lu)
           do (puthash l l hrm--case-fold-hash)
           else do (puthash l (format "[%c%c]" ld lu)
                            hrm--case-fold-hash)))

(hrm--make-case-fold-hash)

(defvar hrm--sigma-hash (make-hash-table :size (length hrm--all-sigmas)))

(defun hrm--make-sigma-hash ()
  (cl-loop for l across hrm--lowercase-sigmas
           do (puthash l hrm--lowercase-sigmas-regexp hrm--sigma-hash))
  (cl-loop for l across hrm--uppercase-sigmas
           do (puthash l hrm--uppercase-sigmas-regexp hrm--sigma-hash)))

(hrm--make-sigma-hash)
#+end_src

