hrm-conv.el

(defun hrm-conv--change-diacritics-placement (string)
  (let ((rx (rx (group "*")
                (group (one-or-more (any ")(/\\=+|—^")))
                (group letter))))
    (replace-regexp-in-string rx "\\1\\3\\2" string)))

(defun hrm-conv--dieresis-before-accent (string)
  (let ((rx (rx (group (any "/\\"))
                (group "+" ))))
    (replace-regexp-in-string rx "\\2\\1" string)))

(defun hrm-conv--capitalize-after-asterisk (string)
  "If STRING contains an asterisk, return STRING with no asterisk
and with the first letter after it capitalized. Otherwise, return
STRING. (This also happens when no letters appear anywhere
following the asterisk.)"
  (if-let ((astr-idx (string-match-p "\*" string))   ; “asterisk index”
           (capt-idx (string-match-p (rx word-start) ; where to capitalize
                                     string (1+ astr-idx))))
      (progn (setq string (concat (substring string 0 astr-idx)
                                  (substring string (1+ astr-idx) capt-idx)
                                  (char-to-string (upcase (elt string capt-idx)))
                                  (substring string (1+ capt-idx))))
             (hrm-conv--capitalize-after-asterisk string))
    string))

(defun hrm-conv--normalize-beta-diacritics (string)
  (thread-first string
    (hrm-conv--change-diacritics-placement)
    (hrm-conv--dieresis-before-accent)
    (hrm-conv--capitalize-after-asterisk)))

(defun hrm-conv--normalize-sigmas (string)
  "Returns a copy of STRING, but with sigmas normalized.
Sigmas which end a word will be replaced with “ς”, while other sigmas
will be replaced with “σ”."
  ;; This function used to look like this:
  ;;
  ;; (replace-regexp-in-string (rx "ς" (not word-boundary)) "σ" string))
  ;;
  ;; An elaborate rewrite was necessary because Emacs’s regexp engine
  ;; now sees “σ” and “ς” as equivalent, which confuses the hell out
  ;; of ‘replace-regexp-in-string’.
  (let ((max (length string))
        done i substrings sigma)
    (while (not done)
      (if-let ((sigma-idx (string-match-p "ς" string i)) ; the actual test
               (next-idx (1+ sigma-idx))
               (new-substring (substring string (or i 0) sigma-idx)))
          ;; sigma is present
          (progn
            (setq sigma
                  ;; does it end a word?
                  (if (or (and (eq next-idx max) (setq done t))
                          (not (eq (char-syntax (elt string next-idx)) ?w)))
                      "ς" ; yes
                    "σ")) ; no
            (setq substrings
                  (cons sigma (cons new-substring substrings)))
            (setq i next-idx))
        ;; no more sigmas
        (if (not i) ; ‘i’ will be nil if the string had no sigmas at all
            (setq done string)
          (push (substring string i max) substrings)
          (setq done t))))
    (if (stringp done)
        done
      (apply #'concat (nreverse substrings)))))

(defun hrm-beta-to-unicode (string &optional input-p match-p)
  "Return STRING converted from Beta code to Unicode.
INPUT-P is whether or not the string should be interpreted as
user input. (The difference is that user input should be read
according to the option ‘hrm-conv-beta-input-type’; otherwise, it
should be read as standard Beta code, as used in the XML LSJ.)
MATCH-P should be non-nil when converting a string to be used
solely for matching (like in the function ‘hrm--re-builder’), in
which case sigma normalization is unnecessary."
  (setq string
        (thread-first string
          (hrm-conv--normalize-beta-diacritics)
          (hrm--convert-string-by-hash (if input-p
                                           hrm--beta-hash--user
                                         hrm--beta-hash--standard))
          (ucs-normalize-NFC-string)))
  (if match-p
      string
    (hrm-conv--normalize-sigmas string)))

(provide 'hrm-conv)

  ;;; hrm-conv.el ends here
