hermeneus.org
** Regex builder
Watch out for:
- Combining diacritics
- Sigmas
- Iotas, iota-subscript, and vowels that can potentially be followed by iota-subscript
#+begin_src emacs-lisp
(defun hrm--re-builder (string)
  ;; Decompose the string into letters and combining diacriticals, and
  ;; translate any Beta code to Unicode
  (setq string (ucs-normalize-NFD-string string))
  (when (string-match-p hrm--beta-all--user-regexp string)
    (setq string (thread-first string
                   (hrm-conv--normalize-beta-diacritics)
                   (hrm-beta-to-unicode t t))))
  ;; Figure out if we need to fold accents or case
  (let* ((fold-accents-p (not (string-match-p
                               (rx (category combining-diacritic))
                               string)))
         (fold-case-p (or (and case-fold-search
                               (not (eq case-fold-search 'auto)))
                          (and (eq case-fold-search 'auto)
                               (let ((case-fold-search nil))
                                 (not (string-match-p (rx upper) string))))))
         ;; Pick a hash to use for the translation
         (hash (if fold-accents-p
                   ;; Yes, folding accents
                   (if fold-case-p
                       hrm--letter-variant-hash-case-folded
                     hrm--letter-variant-hash)
                 ;; No, not folding accents
                 (setq string (ucs-normalize-NFC-string string)) ; recompose accents
                 (if fold-case-p
                     hrm--case-fold-hash
                   hrm--sigma-hash))))
    (hrm--convert-string-by-hash string hash)))
#+end_src

** Matcher
:PROPERTIES:
:ID:       TKR:a4a164ae-0cb8-4e14-b4d1-77d311df2b71
:END:
Performance is insanely critical, here.
#+begin_src emacs-lisp
(defun hrm--re-matcher (regexp candidates)
  "Return all strings in CANDIDATES that match REGEXP.
Strings where the regexp matches at the beginning will be listed
earlier in the result than strings where the regexp matches
elsewhere."
  (if (string-empty-p regexp)
      candidates
    (let (list-1 list-2)
      (dolist (c (reverse candidates))
        (when (string-match-p regexp c)
          (if (string-match-p (concat "^" regexp) c)
              (push c list-1)
            (push c list-2))))
      (append list-1 list-2))))
#+end_src

** End matter
#+begin_src emacs-lisp
  (provide 'hrm-match)

  ;; hrm-match.el ends here
#+end_src

* XML
:PROPERTIES:
:header-args:emacs-lisp: :tangle hrm-xml.el
:END:

** Dependencies
:PROPERTIES:
:ID:       TKR:7a98e386-09fc-4f8a-8cbe-7719ed02b2c0
:END:
#+begin_src emacs-lisp
(require 'url-handlers)
(require 'url)
(require 'url-parse)
(require 'eieio-base)
(require 'cl-lib)
(require 'eieio)
(require 'anaphora)
(require 'dom)
(require 'nnheader)

(eval-when-compile (require 'subr-x)
                   (require 'cl-macs))

(require 'hrm-conv)
#+end_src

** Utility functions

*** Is file an URL?
:PROPERTIES:
:ID:       TKR:7510ef46-dc7c-46df-91d1-3a78ecc55553
:END:
#+begin_src emacs-lisp
(defun hrm--url-p (path)
  "Return non-nil if PATH is a valid URL.
Specifically, this will return a parsed URL object from
  ‘url-generic-parse-url’, otherwise nil."
  (let ((url (url-generic-parse-url path)))
    (when (cl-struct-slot-value 'url 'type url)
      url)))
#+end_src

*** Get the location of the next XML tag
:PROPERTIES:
:ID:       TKR:83796ca2-8149-4c43-8bdf-e89d91ab4a0c
:END:
#+begin_src emacs-lisp
(cl-defun hrm--get-next-tag (&optional (tag "entryFree"))
  "Return start and end positions of the next instance of XML tag TAG
(defaults to “entryFree”). Move point to the end position."
  (save-match-data
    (when (re-search-forward (concat "<" tag (rx word-end)) nil t)
      (let* ((begin (goto-char (match-beginning 0)))
             (end (progn (search-forward (concat "</" tag ">") nil t)
                         (point))))
        (list begin end)))))
#+end_src

*** Get a DOM from an XML file
:PROPERTIES:
:ID:       TKR:8a8cf7a7-ae76-46ec-9774-7930d5d0413a
:END:
#+begin_src emacs-lisp
(cl-defun hrm--get-dom-from-file (file &optional start end
                                       &key plain-xml-p)
  "Return a DOM sexp from the XML file FILE.
If keyword argument PLAIN-XML-P is non-nil, return plain XML instead."
  (when (integerp file)
    (setq file (nth file hrm-lsj-files)))
  (with-temp-buffer
    (hrm--insert-contents file)
    (funcall (if plain-xml-p
                 'buffer-substring
               'libxml-parse-xml-region)
             (or start (point-min))
             (or end (point-max)))))

(defun hrm--insert-contents (file)
  "Insert contents of FILE into the current buffer.
FILE can be a local filename or an URL."
  (if-let ((url (hrm--url-p file)))
      (let ((buffer (url-retrieve-synchronously url nil t 60)))
        (url-insert-buffer-contents buffer url)
        (kill-buffer buffer))
    (if (file-exists-p file)
        (insert-file-contents file)
      (error "File does not exist: %s" file))))
#+end_src

*** Get file sizes
:PROPERTIES:
:ID:       TKR:04b61a99-7801-424c-a895-f6a71e9601ac
:END:
#+begin_src emacs-lisp
(defun hrm--get-file-sizes (list)
  (let ((sizes '(42923474  5014862  4182729 14588543 40082401
                             15614  1233434  2872155  4731605  4600309
                          23622167  6753069 12285441  4142048   922716
                          12279541 38221861   676533   670125  2249926
                          22838928 11626884  9107698  8185312  6534345
                           1596622  1656586)))
    (cl-loop for l in list
             for i from 1 to (length list)
             if (hrm--url-p l)
             collect (nth (1- i) sizes)
             else
             collect (nnheader-file-size l))))
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:c163e73e-c2d6-47f9-8e78-07834c1fe737
:END:
#+begin_src emacs-lisp
(defvar hrm-lsj-files nil)

(cl-defun hrm--set-lsj-dir (&optional (symbol 'hrm-lsj-dir)
                                      (value (if (boundp 'hrm-lsj-dir)
                                                 hrm-lsj-dir
                                               hrm--git-lsj-dir)))
  (set-default symbol value)
  (setq hrm-lsj-files
        (cl-loop for i from 1 to 27
                 with expand-func = (if (hrm--url-p value)
                                        'url-expand-file-name
                                      'expand-file-name)
                 collect (funcall expand-func
                                  (format "grc.lsj.perseus-eng%s.xml" i)
                                  value))))

(defcustom hrm-lsj-dir hrm--git-lsj-dir
  "Directory where the LSJ Greek lexicon files can be found.
This can be an URL or a local file path. The files themselves should
be named in the format “grc.lsj.perseus-engXX.xml”, where XX is a
number from 1 to 27 (no padding).

If you set this outside of Customize, be sure to evaluate
‘hrm--set-lsj-dir’."
  :tag "Hermeneus — LSJ directory"
  :type `(choice (const ,hrm--git-lsj-dir
                        :tag "Perseus Digital Library’s Git repository")
                 (directory :tag "local directory")
                 (string :tag "URL"))
  :set 'hrm--set-lsj-dir
  :group 'hermeneus)

(defvar hrm-use-fonts t)
#+end_src

** Scan the LSJ - eieio-persistent style
:PROPERTIES:
:ID:       TKR:34c72ac9-f545-4bfb-b2b7-8befe008bddf
:END:
#+begin_src emacs-lisp 
;;;###autoload
(defun hrm-scan-lsj ()
  (interactive)
  (oset hrm-lsj entries (hrm-scan-entries))
  (eieio-persistent-save hrm-lsj))

(defun hrm-scan-entries ()
  "Scan over every lexicon entry in the LSJ, using ‘hrm-scan-entry’.
Return a hash table."
  (interactive)
  (let* ((hash (make-hash-table :test 'equal :size 116493))
         (sizes (hrm--get-file-sizes hrm-lsj-files))
         (total 0)
         (prog-msg "Scanning Liddell and Scott")
         (progress (make-progress-reporter prog-msg
                                           0 (apply '+ sizes))))
    (dotimes (i (length hrm-lsj-files))
      (with-temp-buffer
        (hrm--insert-contents (nth i hrm-lsj-files))
        (let ((cur-size (pop sizes))
              (max (point-max)))
          (awhile (hrm--get-next-tag "entryFree")
            (oset (hrm-scan-entry (apply 'libxml-parse-xml-region it) hash) loc (cons i it))
            (progress-reporter-update progress (+ total
                                                  (* cur-size
                                                     (/ (float (cadr it))
                                                        max)))))
          (progress-reporter-update progress (cl-incf total cur-size)))))
    (progress-reporter-done progress)
    hash))

(defun hrm-scan-entry (entry &optional HASH)
  "Scan ENTRY, a DOM sexp of an “entryFree” tag from the LSJ files.
Identify its headword and numeric ID. Create a word object. Add
the headword and object as a key-value pair in hash-table HASH,
if present. Run each function from ‘hrm-scan-entry-functions’
with two arguments, the word object and ENTRY. Finally, return
the object."
  (let* ((key (hrm-beta-to-unicode (dom-attr entry 'key)))
         (id (string-to-number
              (string-remove-prefix "n" (dom-attr entry 'id))))
         (obj (hrm-word :key key :id id)))
    (when hash (puthash key obj hash))
    (run-hook-with-args 'hrm-scan-entry-functions obj entry)
    obj))
#+end_src

