hrm-match.el

(defun hrm--re-builder (string)
  ;; Decompose the string into letters and combining diacriticals, and
  ;; translate any Beta code to Unicode
  (setq string (ucs-normalize-NFD-string string))
  (when (string-match-p hrm--beta-all--user-regexp string)
    (setq string (thread-first string
                   (hrm-conv--normalize-beta-diacritics)
                   (hrm-beta-to-unicode t t))))
  ;; Figure out if we need to fold accents or case
  (let* ((fold-accents-p (not (string-match-p
                               (rx (category combining-diacritic))
                               string)))
         (fold-case-p (or (and case-fold-search
                               (not (eq case-fold-search 'auto)))
                          (and (eq case-fold-search 'auto)
                               (let ((case-fold-search nil))
                                 (not (string-match-p (rx upper) string))))))
         ;; Pick a hash to use for the translation
         (hash (if fold-accents-p
                   ;; Yes, folding accents
                   (if fold-case-p
                       hrm--letter-variant-hash-case-folded
                     hrm--letter-variant-hash)
                 ;; No, not folding accents
                 (setq string (ucs-normalize-NFC-string string)) ; recompose accents
                 (if fold-case-p
                     hrm--case-fold-hash
                   hrm--sigma-hash))))
    (hrm--convert-string-by-hash string hash)))

(defun hrm--re-matcher (regexp candidates)
  "Return all strings in CANDIDATES that match REGEXP.
Strings where the regexp matches at the beginning will be listed
earlier in the result than strings where the regexp matches
elsewhere."
  (if (string-empty-p regexp)
      candidates
    (let (list-1 list-2)
      (dolist (c (reverse candidates))
        (when (string-match-p regexp c)
          (if (string-match-p (concat "^" regexp) c)
              (push c list-1)
            (push c list-2))))
      (append list-1 list-2))))

(provide 'hrm-match)

;;; hrm-match.el ends here
