hermeneus.org
** Hook functions
:PROPERTIES:
:ID:       TKR:b8745465-2261-4607-aef9-af0a26ac6068
:END:
#+begin_src emacs-lisp
#+end_src

** Return all tag types found in the LSJ (for reference; does not tangle)
This code doesn’t work well. If you can tell, I’ve made many attempts to avoid and make note of entries that make the function choke. Still, it always causes hrm-scan-entries to hang somewhere at about 39%. But, the results (see below) /should/ be a complete list of every tag used in the LSJ.
#+begin_src emacs-lisp :tangle no :results replace list :load no
(defvar hrm--all-tag-types nil)
(defvar hrm--current-entry nil)
(defvar hrm--current-children nil)
(defvar hrm--tricky-bastards nil)

(defun hrm--get-tag-types (_obj dom)
  (setq hrm--tricky-bastards nil)
  (awhen (dom-attr dom 'key)
    (setq hrm--current-entry it)
    (setq hrm--current-children (dom-children dom)))
  (let ((tags nil)
        (children (dom-children dom)))
    ;;    (when (equal (dom-attr dom 'key) "ei)/dw1")
    ;;      (setq please-have-mercy-on-me children))
    (cl-loop for elt in children
             if (not (stringp elt))
             do (prog1 (cl-pushnew (symbol-name (dom-tag elt)) hrm--all-tag-types)
                  (if (> (length children) 32)
                      (push elt hrm--tricky-bastards)
                    (hrm--get-tag-types _obj children))))))

(add-hook 'hrm-scan-entry-functions 'hrm--get-tag-types)

(reverse hrm--all-tag-types)
#+end_src

#+RESULTS:
- orth
- gen
- itype
- sense
- foreign
- bibl
- title
- etym
- pron
- gramGrp
- abbr
- tns
- pos
- date
- placeName
- per
- number
- mood
- name
- pb
- subc
- cit
- tr

** End matter
:PROPERTIES:
:ID:       TKR:327d7216-5a65-4f76-b9fd-c2a2742c0ada
:END:
#+begin_src emacs-lisp
(provide 'hrm-xml)

;; hrm-xml.el ends here
#+end_src

* Completion
:PROPERTIES:
:ID:       TKR:49f3f037-acfd-414f-bc51-0a963faa0352
:header-args:emacs-lisp: :tangle hrm-completion.el
:END:

** Dependencies
:PROPERTIES:
:ID:       TKR:a33012b6-462c-44fd-b63f-65f07969227c
:END:
#+begin_src emacs-lisp
(require 'cl-extra)
(require 'custom)
(require 'eieio)
(require 'ucs-normalize)
(require 'rx)

(eval-when-compile (require 'cl-macs)
                   (require 'subr-x))

(require 'hrm-conv)
(require 'hrm-match)
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:7f0bab31-c461-44f0-898d-a80deeefd174
:END:
#+begin_src emacs-lisp
(defcustom hrm-use-ivy (let ((libs '(ivy counsel)))
                         (or (cl-every 'featurep libs)
                             (cl-every 'package-installed-p libs)))
  "Whether to use the ‘ivy’ package for ‘describe-greek-word’.
This allows two important features. The first is matching by Beta
code: if you type in Beta code (i.e. “i(ero/doulos” instead of
“ἱερόδουλος”), it will match as though you typed the Greek
Unicode equivalent. The second is diacritic-agnostic matching: if
you type Greek with no diacritics into the ‘describe-greek-word’
prompt, it will match any combination of diacritics on the same
sequence of letters. This works whether you’re typing in Greek
Unicode or in Beta code: so, either “etaira” or “εταιρα” will
match “ἑταίρα”.

This option has no effect if Ivy is not installed. If Ivy is
installed, but this option is turned off (‘nil’), then the Ivy
version of ‘describe-greek-word’ is still available as the
command ‘counsel-greek-word’."
  :type 'boolean
  :group 'hermeneus)
#+end_src

** Describe Greek word
:PROPERTIES:
:ID:       TKR:4864efa6-7652-4504-b780-f06f24283984
:END:
#+begin_src emacs-lisp
;;;###autoload
(defun describe-greek-word (word)
  (interactive
   (list
    (let ((entries (oref hrm-lsj entries)))
      (if (and hrm-use-ivy (fboundp 'ivy-read))
          (counsel-greek-word "Look up Greek word: " hrm-lsj)
        (let ((default (hrm-greek-word-at-point)))
          (completing-read (format "Look up Greek word%s: "
                                   (if default
                                       (format " (default: %s)" default)
                                     ""))
                           entries nil t nil nil default))))))
  (unless (and hrm-use-ivy (fboundp 'ivy-read))
    (hrm--display-word-buffer word)))
#+end_src

** Read word
:PROPERTIES:
:ID:       TKR:e488b337-55e7-4543-ae83-dfdedc268b8c
:END:
#+begin_src emacs-lisp
(cl-defun counsel-greek-word (&optional (prompt "Look up Greek word:")
                                        (lexicon hrm-lsj) &rest kwargs)
  "Read a Greek word from the LSJ, with Ivy completion.
COLLECTION should be a ‘hrm-lexicon’ object or a hash-table, and
defaults to the value of ‘hrm-lsj’. Any other arguments should be
keyword arguments, which are passed to ‘ivy-read’."
  (unless (fboundp 'ivy-read)
    (error "Ivy must be installed before using ‘counsel-greek-word’"))
  (let ((collection
         (cond ((hrm-lexicon-p lexicon)
                (oref lexicon entries))
               ((hash-table-p lexicon)
                lexicon)
               (t (error "Not a hrm-lexicon object or hash table: %s" lexicon)))))
    (cl-flet ((kw-put (prop val)
                      (unless (plist-member kwargs prop)
                        (cl-callf plist-put kwargs prop val))))
      (kw-put :action #'hrm--display-word-buffer)
      (kw-put :re-builder #'hrm--re-builder)
      (kw-put :matcher #'hrm--re-matcher)
      (awhen (hrm-greek-word-at-point)
        (kw-put :preselect it))
      (apply 'ivy-read prompt collection kwargs))))
#+end_src

** Get Greek letter equivalents
:PROPERTIES:
:ID:       TKR:9804b1a7-dae0-4425-b671-2cdc3b604017
:END:
#+begin_src emacs-lisp
(defun hrm--fold-case (string)
  (cl-loop for l across (regexp-quote string)
           if (memq l (string-to-list hrm--all-sigmas))
           concat (format "[%s]" hrm--all-sigmas)
           else
           concat (let ((upr (upcase l))
                        (lwr (downcase l)))
                    (if (eq upr lwr)
                        (char-to-string l)
                      (format "[%c%c]" upr lwr)))))
#+end_src

** Greek word at point
:PROPERTIES:
:ID:       TKR:3d941c67-20eb-4ad6-9653-bc545e109827
:END:
#+begin_src emacs-lisp
(defun hrm--bounds-of-chars (chars)
  "Skip CHARS backwards and forwards, return a cons of each point.
CHARS is a string containing the characters to skip over. If
point is not adjacent to any characters in CHARS, return nil."
  (let ((rtn (cons
              (save-excursion (skip-chars-backward chars)
                              (point))
              (save-excursion (skip-chars-forward chars)
                              (point)))))
    (unless (eql (car rtn) (cdr rtn))
      rtn)))

(defun hrm-bounds-of-greek-word-at-point ()
  (or (hrm--bounds-of-chars (concat hrm--greek-unicode-all
                                    hrm--greek-diacritics))
      (hrm--bounds-of-chars (concat hrm--beta-letters--user ; TODO should check user and standard variants
                                    hrm--beta-diacritics "*"))))

(defun hrm-greek-word-at-point ()
  (when-let ((bounds (hrm-bounds-of-greek-word-at-point))
             (word (buffer-substring-no-properties (car bounds) (cdr bounds)))
             (obj (hrm--string-to-object word hrm-lsj)))
    (oref obj key)))

(put (intern "greek-word") 'bounds-of-thing-at-point 'hrm-bounds-of-greek-word-at-point)
#+end_src

** Look up Greek word noninteractively
:PROPERTIES:
:ID:       TKR:03304dde-533f-41bb-937b-99e3f31ef2f1
:END:
#+begin_src emacs-lisp
(cl-defun hrm--string-to-object (string &optional (lexicon hrm-lsj))
  "Retrieve the word-object in LEXICON corresponding to STRING.
The function ‘hrm--fuzzy-search’ is used when there isn’t an
exact match. If no result is found, return nil."
  (unless (and (stringp string) (hrm-lexicon-p lexicon))
    (error "Incorrect arguments for ‘hrm--string-to-object’: %s %s"
           string lexicon))
  (or (gethash string (oref lexicon entries))
      (hrm--fuzzy-search string)
      (hrm--fuzzy-search (string-trim string))
      (hrm--fuzzy-search (hrm--trim-string-extra string))))

(cl-defun hrm--fuzzy-search (string &optional (lexicon hrm-lsj))
  "Look up the word STRING in LEXICON (which defaults to the LSJ).
The functions ‘hrm--re-builder’ and ‘hrm--re-matcher’ are used to
provide fuzzy-matching. Returns a word-object."
  (let* ((hrm-beta-input-type 'beta)
         (re (hrm--re-builder string))
         (entries (oref lexicon entries))
         (matches (hrm--re-matcher re (hash-table-keys entries))))
    (when matches
      (gethash (car matches) entries))))
#+end_src

** Display word buffer
:PROPERTIES:
:ID:       TKR:bd16e1ce-fd2c-4c49-9a73-1d2038210079
:END:
#+begin_src emacs-lisp
(cl-defun hrm--display-word-buffer (word &optional (lexicon hrm-lsj))
  "Display WORD, a string or word-object, from LEXICON (default: LSJ)."
  (unless (hrm-word-p word)
    (if (stringp word)
        (setq word (hrm--string-to-object word lexicon))
      (error "Argument is neither a ‘hrm-word’ object nor a string: %s"
             word)))
  (when word
    (hrm--switch-buffer
     (hrm--word-buffer word))))
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:ca2a0940-f58e-4c15-9904-a0889f15eb36
:END:
#+begin_src emacs-lisp
(provide 'hrm-completion)

;; hrm-completion.el ends here
#+end_src

* Storage
:PROPERTIES:
:ID:       TKR:517f86fc-db04-4e9d-8539-6111477bea54
:header-args:emacs-lisp: :tangle hrm-storage.el
:END:

** Dependencies
:PROPERTIES:
:ID:       TKR:76751cd5-569d-483b-a6e0-2050e9760bd7
:END:
#+begin_src emacs-lisp
(require 'eieio)
(require 'eieio-base)
(require 'cl-generic)

(require 'hrm-xml)
#+end_src

