hermeneus.org
** Variables
:PROPERTIES:
:ID:       TKR:cc2d39d7-8b0f-4f8c-adfb-0d5e8d715cfd
:END:
#+begin_src emacs-lisp
(defvar hrm-storage-file (concat "lsj-cache" (when (executable-find "gzip") ".gz")))

(defcustom hrm-storage-dir (expand-file-name "var/hermeneus" user-emacs-directory)
  "Directory in which to store files generated by Hermeneus.
At present, this means where to store the Hermeneus lexicon
cache. If you set this outside Customize, ensure that the
directory exists (creating it if necessary), and set
‘hrm-storage-path’ to the value of calling ‘expand-file-name’
with the new ‘hrm-storage-dir’ value followed by
‘hrm-storage-file’ as arguments."
  :type 'directory
  :tag "Hermeneus — storage directory"
  :group 'hermeneus
  :set (lambda (symbol value)
         (unless (file-exists-p (directory-file-name value))
           (make-directory (directory-file-name value) t))
         (set-default symbol value)
         (setq hrm-storage-path
               (expand-file-name hrm-storage-file value))))

(defvar hrm-storage-path (expand-file-name hrm-storage-file hrm-storage-dir))
#+end_src

** Objects
:PROPERTIES:
:ID:       TKR:ec258183-0deb-4581-a0df-7ad3eec2dcd8
:END:
#+begin_src emacs-lisp
(defclass hrm-word ()
  ((key :type string
        :initarg :key
        :initform "")
   (id :type integer
       :initarg :id
       :initform 0)
   (loc :type (or cons null)
        :initarg :loc
        :initform nil))
  :documentation "A Hermeneus object to represent one word.")

(defclass hrm-lexicon (eieio-persistent)
  ((initialized-p :type boolean
                  :initarg :initialized-p
                  :initform nil)
   (entries :type hash-table
            :initarg :entries
            :initform (make-hash-table :size 116493 :test 'equal))
   ;; I have absolutely zero clue why (file :initform hrm-storage-path)
   ;; results in an “invalid-slot-type” error, but this doesn’t:
   (file :initform (symbol-value 'hrm-storage-path))
   (file-header-line :initform ";; Hermeneus lexicon object"))
  :documentation "A Hermeneus object to represent a lexicon of words.")
#+end_src
** Functions

#+begin_src emacs-lisp
(defun hrm--get-dom-from-word (word)
  "Return the DOM from the XML LSJ definition of word-object WORD."
  (apply #'hrm--get-dom-from-file (oref word loc)))
#+end_src
** Methods
:PROPERTIES:
:ID:       TKR:155090bb-4267-4ec2-be28-e402000a0a0e
:END:
#+begin_src emacs-lisp
(cl-defmethod make-instance ((cls (subclass hrm-lexicon)) &rest slots)
  "When making a ‘hrm-lexicon’ object, try to read it from a file.
(The file’s path can be passed as a “:file” keyword argument, but
otherwise defaults to ‘hrm-storage-path’.) If the file doesn’t exist,
or otherwise can’t be used, move on."
  (let ((path (or (plist-get slots :file)
                  hrm-storage-path)))
    (or (and (file-exists-p path)
             (eieio-persistent-read path cls t))
        (cl-call-next-method))))

(cl-defmethod initialize-instance :after ((this hrm-lexicon) &rest slots)
  "After initializing a ‘hrm-lexicon’ object, populate its ‘entries’
  hash-table with word-objects from the LSJ."
  (let ((entries (oref this entries)))
    ;; Don’t bother scanning the LSJ for entries if the
    ;; ‘entries’ hash-table is already populated, or if
    ;; slot ‘initialize-p’ is nil.
    (unless (or (eq (hash-table-count entries) (hash-table-size entries))
                (oref this initialized-p))
      (oset this entries (hrm-scan-entries))
      (oset this initialized-p t)
      (eieio-persistent-save this))))

(defvar hrm-lsj (hrm-lexicon nil))
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:bdfa271e-9060-4205-bd28-d168aef150d2
:END:
#+begin_src emacs-lisp
(provide 'hrm-storage)

;; hrm-storage.el ends here
#+end_src

* Canonical Text Services
:PROPERTIES:
:header-args:emacs-lisp: :tangle hrm-cts.el
:END:
Most of these code blocks do not tangle, because at present most of this is stuff I used when manually generating ~hrm-abbr.el~ (which contains variables used when expanding abbreviations during the rendering of a lexicon entry). But, given that every work referenced in the LSJ has a Canonical Text Services URN, and the Scaife CTS API is emerging as the primary way to interact programmatically with the Perseus Project catalog of ancient works, I decided Hermeneus needed its own section for dealing with URNs, CTS, and whatnot.

** Variables
#+begin_src emacs-lisp
(defvar hrm-scaife-api-url "http://scaife-cts.perseus.org/api/cts"
  "The URL for the Perseus Project’s Scaife CTS API.")
#+end_src
** Functions
*** Convert URNs
#+begin_src emacs-lisp
(defun hrm-urn-to-base (urn)
  "Return URN with the passage component, if present, removed.
E.g., “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195” will be
returned as “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1”.
URN should be in the Canonical Text Services URN format. See
https://github.com/cite-architecture/ctsurn_spec/blob/master/md/specification.md"
  (save-match-data
    (if (and urn
             (string-match
              (rx (= 4 (one-or-more
                        (not (any control ":" "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                     ":"))
              urn))
        (substring urn 0 (1- (match-end 0)))
      urn)))

(defun hrm-urn-to-work (urn)
  "Return URN shortened to the work part of the work component.
E.g., “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195” will be
returned as “urn:cts:greekLit:tlg0020.tlg001”.
URN should be in the Canonical Text Services URN format. See
https://github.com/cite-architecture/ctsurn_spec/blob/master/md/specification.md"
  (setq urn (hrm-urn-to-base urn))
  (save-match-data
    (if (and urn (string-match
                  (rx (= 3 (one-or-more
                            (not (any control ":" "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                         ":")
                      (= 2 (one-or-more
                            (not (any control "." "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                         "."))
                  urn))
        (substring urn 0 (1- (match-end 0)))
      urn)))

(defun hrm-urn-to-url (urn &optional atom)
  "Return the canonical Perseus Catalog URL for URN.
If ATOM is non-nil, return the URL for the Atom version."
  (concat "http://data.perseus.org/catalog/" (hrm-urn-to-base urn)
          (when atom "/atom")))

#+end_src
*** Return all URNs in LSJ
#+begin_src emacs-lisp :tangle no :load no
(cl-defun hrm--get-all-urns (&optional (files hrm-lsj-files))
  (cl-loop with urns
           for file in files
           do (with-temp-buffer
                (insert-file-contents file)
                (goto-char 1)
                (save-match-data 
                  (while (re-search-forward
                          (rx "<bibl" word-end
                              (* (not ">"))
                              "n=\""
                              (group "urn:cts:"
                                     (* (not (any ":" ">")))
                                     ":"
                                     (* (not (any ":" ">" ".")))
                                     "."
                                     (* (not (any ":" ">" ".")))))
                          nil t)
                    (cl-pushnew (match-string 1) urns :test #'equal))))
           finally return (nreverse urns)))

(defvar hrm--all-urns (hrm--get-all-urns))

(cl-defun hrm--insert-all-urns (&optional (urns hrm--all-urns))
  (interactive)
  (cl-loop for urn in urns
           with add-newline-p
           initially do (insert "'(")
           do (insert "\"" urn "\"")
              (if add-newline-p
                  (progn (setq add-newline-p nil) (insert 10))
                (setq add-newline-p t)
                (insert " "))
           finally do (backward-delete-char 1)
              (insert ")")
              (save-buffer)))
#+end_src
*** Return title from URN
#+begin_src emacs-lisp :tangle no :results no
(require 'request)
(eval-when-compile (require 'subr-x))

(defun hrm--get-title-from-urn (urn)
  (let ((response
         (request-response-data
          (request hrm-scaife-api-url :params `((request . "GetLabel")
                                                (urn . ,urn))
                   :parser #'xml-parse-region
                   :sync t
                   :error #'ignore
                   :timeout 3))))
    (when response
      (thread-first response
        (dom-child-by-tag 'reply)
        (dom-child-by-tag 'label)
        (dom-child-by-tag 'title)
        (dom-text)))))

(cl-defun hrm--make-title-hash (&optional (urns hrm--all-urns))
  (cl-loop for urn in urns
           for title = (hrm--get-title-from-urn urn)
           with hash = (make-hash-table :test #'equal)
           if (not (string-blank-p title))
           do (puthash urn title hash)
           finally return hash))

(cl-defun hrm--insert-title-hash (&optional (urns hrm--all-urns)
                                            &aux (size 0) size-pos)
  (interactive)
  (insert "(defvar hrm-title-hash\n"
          "#s(hash-table size ")
  (setq size-pos (point))
  (insert " test equal rehash-size 1.5 rehash-threshold 0.8125 data\n(")
  (cl-loop for urn in urns
           for title = (hrm--get-title-from-urn urn)
           if (and title (not (string-blank-p title)))
           do (insert (format "%S %S\n" urn title))
              (setq size (1+ size)))
  (save-excursion
    (goto-char size-pos)
    (insert (format "%d" size)))
  (insert ")))"))


;; (hrm--get-title-from-urn (cadr hrm--all-urns))

;; (defvar hrm-title-hash (hrm--make-title-hash))
#+end_src
** End matter
#+begin_src emacs-lisp
  (provide 'hrm-cts)

  ;; hrm-cts.el ends here
#+end_src
* Tags
:PROPERTIES:
:header-args:emacs-lisp: :tangle hrm-tags.el
:END:

** Dependencies
:PROPERTIES:
:ID:       TKR:ef24da1a-db83-4fa2-8e50-04ed115b256a
:END:
#+begin_src emacs-lisp
(require 'gv)
(require 'seq)
(require 'shr)
(require 'dom)

(eval-when-compile (require 'cl-macs)
                   (require 'subr-x))

(require 'hrm-conv)
(require 'hrm-render)
(require 'hrm-abbr) ; standalone file
#+end_src

