hermeneus.org
** Information on tags
:PROPERTIES:
:ID:       TKR:a677b07d-8387-4fff-82a4-3d0401409dee
:END:
These descriptions are taken from the [[https://tei-c.org/Vault/P4/][TEI P4 Guidelines]] (which is obsolete, but the LSJ XML files use it so we’ll use it too). There is some context missing: some tags are meant to be nested inside one or more other tags, but those groupings are not reflected in this simple list.

In this list, items at list level 1 are citations, items at level 2 are tags, items at level 3 are attributes of the tag above it, and items at level 4 contain explanatory information.

- [[https://tei-c.org/Vault/P4/doc/html/ST.html][Structure of the TEI Document Type Definition]]
  - /(these can be used in any tag)/
    - id :: provides a unique identifier for the element bearing the ID value.
      - Values: any valid name. Default: #IMPLIED
      - Example: <p id="names">Paragraph with the ID <mentioned>names</mentioned>.</p>  <p id="dates">Paragraph with the ID <mentioned>dates</mentioned>.</p> 
      - Note: The id attribute may be used to specify a canonical reference for an element; see section 6.9 Reference Systems.
    - n :: gives a number (or other label) for an element, which is not necessarily unique within the document.
      - Values: any string of characters; often, but not necessarily, numeric.
      - Default: #IMPLIED
      - Note: The n attribute may be used to specify the numbering of chapters, sections, list items, etc.; it may also be used in the specification of a standard reference system for the text.
    - lang :: indicates the language of the element content, usually using a two- or three-letter code from ISO 639.
      - Values: The value must be the identifier of a <language> element supplied in the TEI Header of the current document; that element may also specify a writing system declaration by means of its wsd attribute, as described in section 5.4.2 Language Usage.
      - Default: %INHERITED;
      - Example:  <p lang="en">The only surviving work by <name>Ari</name> (died 1148) is the ten-page <title lang="is">slendingabk</title>  (<title lang="la">Libellus Islandorum</title>), written in the early twelfth century.</p>
      - Note: If no value is specified for lang, the lang value for the immediately enclosing element is inherited; for this reason, a value should always be specified on the outermost element (<TEI.2>).
    - rend :: indicates how the element in question was rendered or presented in the source text.
      - Values: any string of characters; if the typographic rendition of a text is to be systematically recorded, a systematic set of values for the rend attribute should be defined.
      - Default: #IMPLIED
      - Note: These Guidelines make no binding recommendations for the values of the rend attribute; the characteristics of visual presentation vary too much from text to text and the decision to record or ignore individual characteristics varies too much from project to project. Some potentially useful conventions are noted from time to time at appropriate points in the Guidelines.
- [[https://tei-c.org/Vault/P4/doc/html/CO.html][Elements Available in All TEI Documents]]
  - <foreign> :: identifies a word or phrase as belonging to some language other than that of the surrounding text.
  - <cit> :: A quotation from some other document, together with a bibliographic reference to its source.
  - <name> :: contains a proper noun or noun phrase.
    - type :: indicates the type of the object which is being named by the phrase.
  - <abbr> :: contains an abbreviation of any sort.
    - expan :: (expansion) gives an expansion of the abbreviation.
    - resp :: (responsibility) signifies the editor or transcriber responsible for supplying the expansion of the abbreviation held as the value of the expan attribute.
    - type :: allows the encoder to classify the abbreviation according to some convenient typology.
    - cert :: (certainty) signifies the degree of certainty ascribed to the expansion of the abbreviation.
  - <date> :: contains a date in any format.
    - calendar :: indicates the system or calendar to which the date belongs.
    - value :: gives the value of the date in some standard form, usually yyyy-mm-dd.
    - certainty :: indicates the degree of precision to be attributed to the date.
  - <pb> :: marks the boundary between one page of a text and the next in a standard reference system.
    - ed :: (edition) indicates the edition or version in which the page break is located at this point.
  - <bibl> :: contains a loosely-structured bibliographic citation of which the sub-components may or may not be explicitly tagged.
  - <biblScope> :: defines the scope of a bibliographic reference, for example as a list of pagenumbers, or a named subdivision of a larger work.
    - type :: identifies the type of information conveyed by the element, e.g. ‘pages’, ‘volume’.
  - <title> :: contains the title of a work, whether article, book, journal, or series, including any alternative titles or subtitles.
    - level :: (bibliographic level (or class) of title) indicates whether this is the title of an article, book, journal, series, or unpublished material.
    - type :: (type of title) classifies the title according to some convenient typology.
  - <author> :: in a bibliographic reference, contains the name of the author(s), personal or corporate, of a work; the primary statement of responsibility for any bibliographic item.
- [[https://tei-c.org/Vault/P4/doc/html/DI.html][Print Dictionaries]]
  - <entryFree> :: contains a dictionary entry which does not necessarily conform to the constraints imposed by the entry element
  - <sense> :: groups together all information relating to one word sense in a dictionary entry (definitions, examples, translation equivalents, etc.)
    - level :: gives the nesting depth of this sense.
  - <gramGrp> :: groups morpho-syntactic information about a lexical item, e.g. pos, gen, number, case, or itype (inflectional class)
  - <etym> :: encloses the etymological information in a dictionary entry.
  - <orth> :: gives the orthographic form of a dictionary headword.
    - type :: gives the type of spelling.
    - extent :: gives the extent of the orthographic information provided.
  - <pron> :: contains the pronunciation(s) of the word. /(Tina, get your mind out of the gutter)/
    - extent :: indicates whether the pronunciation is for whole word or part.
  - <gen> :: identifies the morphological gender of a lexical item, as given in the dictionary.
  - <number> :: indicates grammatical number associated with a form, as given in a dictionary.
  - <per> :: contains an indication of the grammatical person (1st, 2nd, 3rd, etc.) associated with a given inflected form in a dictionary.
  - <tns> :: indicates the grammatical tense associated with a given inflected form in a dictionary.
  - <mood> :: contains information about the grammatical mood of verbs (e.g. indicative, subjunctive, imperative)
  - <itype> :: indicates the inflectional class associated with a lexical item.
    - type :: indicates the type of indicator used to specify the inflection class, when it is necessary to distinguish between the usual abbreviated indications (e.g. ‘inv’) and other kinds of indicators, such as special codes referring to conjugation patterns, etc.
  - <pos> :: Indicates the part of speech assigned to a dictionary headword (noun, verb, adjective, etc.)
  - <subc> :: contains subcategorization information (transitive/intransitive, countable/non-countable, etc.)
  - <tr> :: contains a translation of the headword or an example.
- [[https://tei-c.org/Vault/P4/doc/html/ND.html][Names and Dates]]
  - <placeName> :: contains an absolute or relative place name.

** Variables
:PROPERTIES:
:ID:       TKR:a3a484db-d437-4e0f-8544-861f94061a64
:END:
#+begin_src emacs-lisp
(defface hrm-default-face '((t nil))
  "Default face for Hermeneus text display."
  :tag "Hermeneus — default face"
  :group 'hrm-faces)

(defvar hrm-tei-tags '(foreign cit name abbr date pb bibl biblScope
                               title author entryFree sense gramGrp etym
                               orth pron gen number per tns mood itype pos
                               subc tr))

(defvar hrm--prev-tag nil)
(defvar hrm--prev-author nil)

(defvar hrm--bibl-urn nil
  "The CTS URN cited by the current bibl tag.
Should be nil if Hermeneus is not currently rendering a bibl tag.")

(defvar hrm-defined-tags nil)

(defvar hrm--tag-keywords '(:attrs :face :render :doc-source))
#+end_src

*** Local variables
:PROPERTIES:
:ID:       TKR:036c52c4-109f-447d-a270-b93a2a48d8a7
:END:
#+begin_src emacs-lisp
(defvar-local hrm--word-obj nil)
(defvar-local hrm--word-dom nil)

(defvar-local hrm-doc-source nil)
#+end_src

** Options
#+begin_src emacs-lisp
(defcustom hrm-expand-abbreviations t
  "Whether abbreviations in definitions should be expanded.
If non-nil, Hermeneus will attempt to expand abbreviations (of
authors, works, etc.) found when displaying a definition. The
abbreviation will be available as the ‘help-echo’ (“tooltip”)
property of the expanded text. If nil, abbreviations will remain,
with expansions written as ‘help-echo’ properties."
  :type 'boolean
  :tag "Hermeneus — expand abbreviations"
  :group 'hermeneus)
#+end_src

** Functions
:PROPERTIES:
:ID:       TKR:170c9de8-c302-4f27-b7c6-46e2dc15372a
:END:
#+begin_src emacs-lisp
(defun hrm--render-generic (dom &optional tag face)
  (unless tag
    (setq tag (dom-tag dom)))
  (unless face
    (setq face (intern-soft (format "hrm-face-%s" tag))))
  (hrm--insert-space-maybe)
  (shr-fontize-dom dom face)
  (setq hrm--prev-tag tag))

(defun hrm--insert-space-maybe ()
  (unless (or (bobp) (bolp)
              (let ((cs (char-syntax (char-before))))
                (or (eq cs 32) (eq cs ?\())))
    (shr-insert " ")))
#+end_src

** Buttons
:PROPERTIES:
:ID:       TKR:9807ac9b-f45b-4b1a-abbb-149cc3593b84
:END:
#+begin_src emacs-lisp
(defun hrm-greek-word-button-action (button)
  (hrm--display-word-buffer (button-get button 'target)))

(define-button-type 'hrm-greek-word-button
  'action #'hrm-greek-word-button-action
  'target nil)
#+end_src

