hrm-tags.el

(defface hrm-default-face '((t nil))
  "Default face for Hermeneus text display."
  :tag "Hermeneus — default face"
  :group 'hrm-faces)

(defvar hrm-tei-tags '(foreign cit name abbr date pb bibl biblScope
                               title author entryFree sense gramGrp etym
                               orth pron gen number per tns mood itype pos
                               subc tr))

(defvar hrm--prev-tag nil)
(defvar hrm--prev-author nil)

(defvar hrm-defined-tags nil)

(defvar hrm--tag-keywords '(:attrs :face :render :doc-source))

(defvar-local hrm--word-obj nil)
(defvar-local hrm--word-dom nil)

(defvar-local hrm-doc-source nil)

(defcustom hrm-expand-abbreviations t
  "Whether abbreviations in definitions should be expanded.
If non-nil, Hermeneus will attempt to expand abbreviations (of
authors, works, etc.) found when displaying a definition. The
abbreviation will be available as the ‘help-echo’ (“tooltip”)
property of the expanded text. If nil, abbreviations will remain,
with expansions written as ‘help-echo’ properties."
  :type 'boolean
  :tag "Hermeneus — expand abbreviations"
  :group 'hermeneus)

(defun hrm--render-generic (dom &optional tag face)
  (unless tag
    (setq tag (dom-tag dom)))
  (unless face
    (setq face (intern-soft (format "hrm-face-%s" tag))))
  (hrm--insert-space-maybe)
  (shr-fontize-dom dom face)
  (setq hrm--prev-tag tag))

(defun hrm--insert-space-maybe ()
  (unless (or (bobp) (bolp)
              (let ((cs (char-syntax (char-before))))
                (or (eq cs 32) (eq cs ?\())))
    (shr-insert " ")))

(defun hrm-greek-word-button-action (button)
  (hrm--display-word-buffer (button-get button 'target)))

(define-button-type 'hrm-greek-word-button
  'action #'hrm-greek-word-button-action
  'target nil)
