hrm-tags.el

;; The reason for this function, and its use in Hermeneus macros, is
;; to make it easier for non-Lisp people to make customizations.
;; (i.e., learning Ancient Greek is hard enough without having to
;; remember how Lisp plists work)
(defun hrm--normalize-keywords (list)
  "Make a proper plist from a list of keyword arguments.
For example, “'(:hero sonic tails knuckles :villain eggman)”
will return “'(:hero (sonic tails knuckles) :villain eggman)”,
which is more readable to ‘plist-get’ and related functions."
  (let (rtn)
    (while list
      (if (or (keywordp (car list))
              (keywordp (cadr list))
              (null (cadr list)))
          (push (pop list) rtn)
        (push (cl-loop repeat (length list)
                       until (keywordp (car list))
                       collect (pop list))
              rtn)))
    (nreverse rtn)))

(defun hrm--doc-concat (&rest strings)
  (with-temp-buffer
    (insert (apply 'concat strings))
    (goto-char 1)
    (while (not (eq (line-end-position) (point-max)))
      (forward-line)
      (unless (eq (line-beginning-position) (line-end-position))
        (fill-region (line-beginning-position) (line-end-position))))
    (buffer-string)))

(defun hrm--doc-source (doc-source)
  (when (and (symbolp doc-source) (boundp doc-source))
    (setq doc-source (symbol-value doc-source)))
  (cond ((stringp doc-source)
         (format "\n\nInformation from %s" doc-source))
        ((and (listp doc-source)
              (stringp (car doc-source)) (stringp (cadr doc-source)))
         (format "\n\nInformation from “%s”\n%s" (cadr doc-source) (car doc-source)))))

(defun hrm--format-attrs (attrs)
  (cl-loop while attrs
           concat (let* ((attr (pop attrs))
                         (desc (pop attrs)))
                    (format "\n‘%s’ %s" attr desc))))

(cl-defmacro define-hrm-tag (tag &rest args)
  "Macro for defining XML tags in Hermeneus.
TAG is the unquoted name of the tag in question.

DOCSTRING is an optional description that, when given, will be
prepended with the name of the tag and used in docstrings for
constructs defined by ‘define-hrm-tag’. e.g. the docstring used
in the ‘define-hrm-tag’ definition for <name> is \"contains a
proper noun or noun phrase.\", and the docstring generated for
the function ‘hrm-render-name’ includes \"‘<name>’ contains a
proper noun or noun phrase.\" Do not use line breaks to wrap the
string; line breaks will be added automatically to the generated
docstrings.

‘define-hrm-tag’ accepts the following keyword arguments:

ATTRS is a list (though it can be expressed inline; see the
function ‘hrm---normalize-keywords’) of tag attributes, in the
form \"ATTR DOCSTRING ATTR DOCSTRING …\". Each ATTR is the
unquoted name of an attribute specific to this tag, and each
DOCSTRING is a short string describing the preceding attribute.
Like with the main docstring for the tag, do not use line breaks
for wrapping, and expect each string to be prepended with the
name of the attribute.

FACE is a quoted face specification which Hermeneus will use when
displaying the tag. See Info node ‘(elisp)Defining Faces’. The
resulting face will be named in the format ‘hrm-face-TAG’. If
FACE is not given, then no special face will be used for
displaying the tag.

RENDER is a series of sexps which will be used to define a
function for rendering the tag’s contents. The function will be
named in the format `hrm-render-TAG’ and will be given one
argument, ‘dom’, which is the DOM of the tag being rendered (see
Info node ‘(elisp)Document Object Model’). If RENDER is absent,
then the special function ‘hrm--render-generic’ will be used to
render the tag.
Note that if you define your own rendering function using RENDER,
any face spec defined using FACE will have to be manually taken
into account by your function definition. Remember, such a face
is named in the format ‘hrm-face-TAG’.

DOC-SOURCE is a symbol, a string, or a list of two strings which
serves as a citation for the information contained in DOCSTRING
and ATTRS. Use this if you copied such information from somewhere
else, i.e. a specification like the TEI P4 Guidelines. If
DOC-SOURCE is a bound symbol, it will be set to that symbol’s
value as a variable. If DOC-SOURCE is a string, it will be
interpreted generically (adding \"Information from \" followed by
DOC-SOURCE to the docstrings of relevant constructs), and if
DOC-SOURCE is a list of two strings, it will be interpreted as
the URL of a publication followed by its title.
If DOC-SOURCE is not given, then the value of ‘hrm-doc-source’
will be used instead. If that value is nil (the default), then no
citation will appear in the relevant docstrings."
  ;; Note that I’m not sure if that last part actually works, urgh
  (declare (advertised-calling-convention
            (tag &optional docstring &key attrs face render doc-source &allow-other-keys) "")
           (indent defun)
           (doc-string 2)
           ;; The following debug spec doesn’t actually work, and
           ;; Edebug’s error messages on the matter are almost
           ;; Microsoftian in their opacity.
           ;; Let the record show that I tried.
           ;; (debug (&define name [&optional stringp]
           ;;                 &rest [&or [":render" def-body]
           ;;                            [keywordp &rest [&not keywordp]]]))
           )
  ;; Get the keywords
  (let* ((docstring (prog1 (when (stringp (car args)) (pop args))
                      (while (not (or (null (car args))
                                      (keywordp (car args))))
                        (pop args))))
         (kw-args (hrm--normalize-keywords args))
         (kw-vals (mapcar (lambda (x) (plist-get kw-args x))
                          hrm--tag-keywords)))
    ;; (small exception for ‘doc-source’—if it’s not given as an
    ;; argument, but ‘hrm-doc-source’ has a value outside the macro
    ;; call, use that value instead of ‘nil’)
    (when (and (not (plist-get kw-args :doc-source))
               (boundp 'hrm-doc-source))
      (let ((ds-pos (seq-position hrm--tag-keywords :doc-source)))
        (setf (elt kw-vals ds-pos) hrm-doc-source)))
    ;; Bind the keywords locally
    (cl-progv
        (mapcar
         (lambda (x) (thread-last x
                       (symbol-name)
                       (string-remove-prefix ":")
                       (intern)))
         hrm--tag-keywords)
        kw-vals
      ;; Finally, write out the definitions
      (let ((face-name (intern (format "hrm-face-%s" tag))))
        `(progn
           (defface ,face-name
             ,(if face
                  `,@face
                `'((t (:inherit hrm-default-face))))
             ,(hrm--doc-concat
               (format "Face used to render the XML tag ‘<%1$s>’.\n‘<%1$s>’ %2$s"
                       tag docstring)
               (hrm--doc-source doc-source))
             :tag ,(format "Hermeneus — face for XML tag <%s>" tag)
             :group 'hrm-faces)
           (defun ,(intern (format "hrm-render-%s" tag)) (dom)
             ,(hrm--doc-concat
               (format "Rendering function for the XML tag ‘<%1$s>’.\n‘<%1$s>’ %2$s"
                       tag docstring)
               (when attrs (concat "\n\nAttributes:"
                                   (hrm--format-attrs attrs)))
               (hrm--doc-source doc-source))
             ,@(if render
                   `,@(if (or (atom render) (atom (car render)))
                          (list render)
                        render)
                 (list `(hrm--render-generic dom ',tag ',face-name))))
           ;; (I know that ‘add-to-list’ is supposed to be used
           ;; sparingly in Lisp code, but the fact that ‘push’ would
           ;; add to the front of the list here is just too much for
           ;; my autistic sensibilities.)
           (add-to-list 'hrm-defined-tags ',tag t))))))

(let ((hrm-doc-source '("https://tei-c.org/Vault/P4/doc/html/CO.html" "Elements Available in All TEI Documents")))
