hrm-tags.el
  (define-hrm-tag foreign
    "identifies a word or phrase as belonging to some language other than that of the surrounding text.")

  (define-hrm-tag cit
    "A quotation from some other document, together with a bibliographic reference to its source.")

  (define-hrm-tag name
    "contains a proper noun or noun phrase."
    :attrs
    type "indicates the type of the object which is being named by the phrase.")

  (define-hrm-tag abbr
    "contains an abbreviation of any sort."
    :attrs
    expan "(expansion) gives an expansion of the abbreviation."
    resp "(responsibility) signifies the editor or transcriber responsible for supplying the expansion of the abbreviation held as the value of the expan attribute."
    type "allows the encoder to classify the abbreviation according to some convenient typology."
    cert "(certainty) signifies the degree of certainty ascribed to the expansion of the abbreviation.")

  (define-hrm-tag date
    "contains a date in any format."
    :attrs
    calendar "indicates the system or calendar to which the date belongs."
    value "gives the value of the date in some standard form, usually yyyy-mm-dd."
    certainty "indicates the degree of precision to be attributed to the date.")

  (define-hrm-tag pb
    "marks the boundary between one page of a text and the next in a standard reference system."
    :attrs
    ed "(edition) indicates the edition or version in which the page break is located at this point.")

  (define-hrm-tag bibl
    "contains a loosely-structured bibliographic citation of which the sub-components may or may not be explicitly tagged.")

  (define-hrm-tag biblScope
    "defines the scope of a bibliographic reference, for example as a list of pagenumbers, or a named subdivision of a larger work."
    :attrs
    type "identifies the type of information conveyed by the element, e.g. ‘pages’, ‘volume’.")

  (define-hrm-tag title
    "contains the title of a work, whether article, book, journal, or series, including any alternative titles or subtitles."
    :attrs
    level "(bibliographic level (or class) of title) indicates whether this is the title of an article, book, journal, series, or unpublished material."
    type "(type of title) classifies the title according to some convenient typology.")

  (define-hrm-tag author
    "in a bibliographic reference, contains the name of the author(s), personal or corporate, of a work; the primary statement of responsibility for any bibliographic item.")
)

(let ((hrm-doc-source '("https://tei-c.org/Vault/P4/doc/html/DI.html" "Print Dictionaries")))
(define-hrm-tag entryFree
  "contains a dictionary entry which does not necessarily conform to the constraints imposed by the entry element."
  :render
  (let* ((key (dom-attr dom 'key))
         (id (dom-attr dom 'id))
         (heading (dom-node nil nil (hrm-beta-to-unicode key))))
    (shr-ensure-paragraph)
    (shr-heading heading 'info-title-3)
    (shr-fontize-dom dom 'hrm-face-entryFree)
    (shr-ensure-paragraph))
  (setq hrm--prev-tag 'entryFree))

(define-hrm-tag sense
  "groups together all information relating to one word sense in a dictionary entry (definitions, examples, translation equivalents, etc.)"
  :attrs
  level "gives the nesting depth of this sense."
  :render
  (shr-ensure-newline)
  (let ((start (point))
        (start-pixel (hrm--pixel-column)))
    (let* ((bullet (shr-insert (concat (dom-attr dom 'n) ". "))) ; bullet is inserted, here
           (width (- (hrm--pixel-column) start-pixel))
           (margin (* (string-to-number (dom-attr dom 'level))
                      (hrm--margin-indent-width))))
      (shr-mark-fill start)
      (put-text-property start (1+ start)
                         'shr-continuation-indentation margin)
      (put-text-property start (1+ start) 'shr-indentation (- margin width))
      (shr-fontize-dom dom 'hrm-face-sense)))
  (unless (bolp)
    (insert "\n"))
  (setq hrm--prev-tag 'sense))

(define-hrm-tag gramGrp
  "groups morpho-syntactic information about a lexical item, e.g. pos, gen, number, case, or itype (inflectional class).")

(define-hrm-tag etym
  "encloses the etymological information in a dictionary entry.")

(define-hrm-tag xr
  "contains a phrase, sentence, or icon referring the reader to some other location in this or another text."
  :attrs
  type "indicates the type of cross reference, using any convenient typology.")

(define-hrm-tag orth
  "gives the orthographic form of a dictionary headword."
  :attrs
  type "gives the type of spelling."
  extent "gives the extent of the orthographic information provided.")

(define-hrm-tag pron           ; Tina, get your mind out of the gutter
  "contains the pronunciation(s) of the word."
  :attrs
  extent "indicates whether the pronunciation is for whole word or part.")

(define-hrm-tag lbl
  "in dictionaries, contains a label for a form, example, translation, or other piece of information, e.g. abbreviation for, contraction of, literally, approximately, synonyms:, etc."
  :attrs
  type "classifies the label using any convenient typology.")

(define-hrm-tag gen
  "identifies the morphological gender of a lexical item, as given in the dictionary.")

(define-hrm-tag number
  "indicates grammatical number associated with a form, as given in a dictionary.")

(define-hrm-tag per
  "contains an indication of the grammatical person (1st, 2nd, 3rd, etc.) associated with a given inflected form in a dictionary.")

(define-hrm-tag tns
  "indicates the grammatical tense associated with a given inflected form in a dictionary.")

(define-hrm-tag mood
  "contains information about the grammatical mood of verbs (e.g. indicative, subjunctive, imperative)")

(define-hrm-tag itype
  "indicates the inflectional class associated with a lexical item."
  :attrs
  type "indicates the type of indicator used to specify the inflection class, when it is necessary to distinguish between the usual abbreviated indications (e.g. ‘inv’) and other kinds of indicators, such as special codes referring to conjugation patterns, etc.")

(define-hrm-tag pos
  "Indicates the part of speech assigned to a dictionary headword (noun, verb, adjective, etc.)")

(define-hrm-tag subc
  "contains subcategorization information (transitive/intransitive, countable/non-countable, etc.)")

(define-hrm-tag tr
  "contains a translation of the headword or an example.")
)
