hermeneus.org
*** Linking, Segmentation, and Alignment
:PROPERTIES:
:ID:       TKR:16b30fea-d72a-46ed-8d7b-3ad080969fd1
:END:
#+begin_src emacs-lisp :var hrm-doc-source='("https://tei-c.org/Vault/P4/doc/html/ND.html" "Linking, Segmentation, and Alignment")
(define-hrm-tag ref
  "defines a reference to another location in the current document, in terms of one or more identifiable elements, possibly modified by additional text or comment."
  :face
  '((t . (:inherit shr-link)))
  :render
  (if-let ((string1 (car (dom-strings dom)))
           
           ;; not sure how we will handle links to prefixes/suffixes,
           ;; so they are disabled for now
           ((not (string-prefix-p "-" (string-trim string1))))
           ((not (string-suffix-p "-" (string-trim string1))))
           
           (entries (oref hrm-lsj entries))
           (target (hrm--string-to-object string1)))
      (progn (hrm--insert-space-maybe)
             (let ((start (point)))
               (hrm--render-generic dom 'ref 'hrm-face-ref)
               (make-button start (point)
                            :type 'hrm-greek-word-button
                            'target target)))
    (hrm--render-generic dom 'ref 'hrm-default-face))
  :attrs
  target "specifies the destination of the reference by supplying the value of the id attribute on one or more other elements in the current document."
  type "categorizes the pointer in some respect, using any convenient set of categories.
Values: The type should indicate the intended function of the pointer, or the rhetorical relationship between its source and the target.
Default: #IMPLIED"
  resp "specifies the creator of the pointer.
Values: any string of characters, usually the initials or name of the creator.
Default: #IMPLIED"
  crdate "specifies when the pointer was created.
Values: A date in ISO 8601 format, generally yyyy-mm-dd.
Default: #IMPLIED"
  targType "specifies the kinds of elements to which this pointer may point.
Values: A list of valid element names declared in the DTD of the current document.
Default: #IMPLIED
Note: If this attribute is supplied, every element specified as a target must be of one or other of the types specified. An application may choose whether or not to report failures to satisfy this constraint as errors, but may not access an element of the right identifier but the wrong type."
  targOrder "where more than one identifier is supplied as the value of the target attribute, this attribute specifies whether the order in which they are supplied is significant.
Legal values are:
Y	Yes: the order in which IDREF values are specified as the value of a target attribute should be followed when combining the targeted elements.
N	No: the order in which IDREF values are specified as the value of a target attribute has no significance when combining the targeted elements.
U	Unspecified: the order in which IDREF values are specified as the value of a target attribute may or may not be significant.
Default: U"
  evaluate "specifies the intended meaning when the target of a pointer is itself a pointer.
Legal values are:
all	if the element pointed to is itself a pointer, then the target of that pointer will be taken, and so on, until an element is found which is not a pointer.
one	if the element pointed to is itself a pointer, then its target (whether a pointer or not) is taken as the target of this pointer.
none	no further evaluation of targets is carried out beyond that needed to find the element specified in the pointer's target.
Default: #IMPLIED
Note: If no value is given, the application program is responsible for deciding (possibly on the basis of user input) how far to trace a chain of pointers.")
#+end_src

*** Names and Dates
:PROPERTIES:
:ID:       TKR:87ee579a-cc46-4178-ab45-82a5c9cf108d
:END:
#+begin_src emacs-lisp :var hrm-doc-source='("https://tei-c.org/Vault/P4/doc/html/ND.html" "Names and Dates")
(define-hrm-tag placeName
  "contains an absolute or relative place name.")
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:e6beb538-1f11-4102-b744-0f9a6c7a9980
:END:
#+begin_src emacs-lisp
(provide 'hrm-tags)

;; hrm-tags.el ends here
#+end_src

* Renderer
:PROPERTIES:
:ID:       TKR:255fa4f5-47e9-4b9c-9cca-2ad83135842d
:header-args:emacs-lisp: :tangle hrm-render.el
:END:
Here we use the [[lib:shr][Simple HTML Renderer]] to render entries from the LSJ as though they were HTML documents.

** Dependencies
:PROPERTIES:
:ID:       TKR:aad6b242-9100-4505-9739-dbcfc187c036
:END:
#+begin_src emacs-lisp
(require 'gv)
(require 'widget)
(require 'tree-widget)
(require 'anaphora)
(require 'shr)
(require 'dom)
(require 'hrm-xml)
(require 'eieio)
(require 'seq)

(eval-when-compile (require 'cl-macs)
                   (require 'rx)
                   (require 'subr-x))

(require 'hrm-conv)
(require 'hrm-xml)
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:6cfdaa3c-43a4-4acc-ac6f-ec4c0f33091c
:END:
#+begin_src emacs-lisp
(defcustom hrm-show-entry-source nil
  "Whether to show the document source after a word definition.
This affects the word defintiions displayed by ‘describe-greek-word’
and ‘counsel-greek-word’.

When this is set to “XML” (symbol ‘xml’), then any definition
displayed will be followed by the definition’s original XML
source. When this is set to “DOM sexp” (symbol ‘sexp’), the
source will be displayed in the form of the DOM sexp that was
generated from the XML by ‘libxml-parse-xml-region’ and used by
Hermeneus to interpret and render the definition. When this is
set to “both” (symbol ‘both’, or t), then the source will be
displayed as XML and as a DOM sexp. When this is set to
“no” (nil), the default, then no source will be displayed below
the definition."
  :type '(choice (const xml :tag "XML")
                 (const sexp :tag "DOM sexp")
                 (const both :tag "both")
                 (const nil :tag "no"))
  :tag "Hermeneus — show entry source?"
  :group 'hermeneus)

(defcustom hrm-show-entry-source-tidy-p t
  "Whether to tidy the displayed XML source using Tidy.
Tidy is an external program that makes XML sources easier to
read. If it is not installed, or if “Hermeneus — show entry
source?” (‘hrm-show-entry-source-p’) is nil, this option is
ignored.

Find out more about Tidy at http://www.html-tidy.org"
  :type 'boolean
  :tag "Hermeneus — tidy entry source?"
  :group 'hermeneus)

(defcustom hrm-show-entry-source-tidy-config
  (expand-file-name "hrm-tidy.conf" (file-name-directory
                                     (locate-library "hermeneus")))
  "Configuration file to use with Tidy when tidying XML sources.
See options “Hermeneus — show entry source?” (‘hrm-show-entry-source-p’)
and “Hermeneus — tidy entry source?” (‘hrm-show-entry-source-tidy’).

Find out more about Tidy at http://www.html-tidy.org"
  :type 'file
  :tag "Hermeneus — Tidy config file"
  :group 'hermeneus)
#+end_src

** Functions
:PROPERTIES:
:ID:       TKR:40231884-7d27-4fa7-a8a5-52bbab041a20
:END:
#+begin_src emacs-lisp
(defun hrm--roman-numeral-p (string)
  "A limited test for whether STRING represents a Roman numeral.
This is to allow proper spacing for Roman-numbered list bullets.
The limitation is that it can’t tell when a single letter (“I”, “V”,
“X”, etc.) is supposed to be a Roman numeral or not, and in those
cases it will return nil."
  (when (> (length string) 1)
    (string-match-p "\\`M?M?M?C?M?D?C?C?C?D?C?X?C?L?X?L?X?X?X?I?X?V?I?V?I?I?I?\\'" string)))

(defun hrm--margin-indent-width ()
  (shr-string-pixel-width
   (propertize "XIII " :face 'hrm-default-face)))

(defun hrm--pixel-column ()
  (let ((pos (point)))
    (prog1 (shr-pixel-column)
      (goto-char pos))))
#+end_src

