hrm-render.el
(require 'gv)
(require 'widget)
(require 'tree-widget)
(require 'anaphora)
(require 'shr)
(require 'dom)
(require 'hrm-xml)
(require 'eieio)
(require 'seq)

(eval-when-compile (require 'cl-macs)
                   (require 'rx)
                   (require 'subr-x))

(require 'hrm-conv)
(require 'hrm-xml)

(defcustom hrm-show-entry-source nil
  "Whether to show the document source after a word definition.
This affects the word defintiions displayed by ‘describe-greek-word’
and ‘counsel-greek-word’.

When this is set to “XML” (symbol ‘xml’), then any definition
displayed will be followed by the definition’s original XML
source. When this is set to “DOM sexp” (symbol ‘sexp’), the
source will be displayed in the form of the DOM sexp that was
generated from the XML by ‘libxml-parse-xml-region’ and used by
Hermeneus to interpret and render the definition. When this is
set to “both” (symbol ‘both’, or t), then the source will be
displayed as XML and as a DOM sexp. When this is set to
“no” (nil), the default, then no source will be displayed below
the definition."
  :type '(choice (const xml :tag "XML")
                 (const sexp :tag "DOM sexp")
                 (const both :tag "both")
                 (const nil :tag "no"))
  :tag "Hermeneus — show entry source?"
  :group 'hermeneus)

(defcustom hrm-show-entry-source-tidy-p t
  "Whether to tidy the displayed XML source using Tidy.
Tidy is an external program that makes XML sources easier to
read. If it is not installed, or if “Hermeneus — show entry
source?” (‘hrm-show-entry-source-p’) is nil, this option is
ignored.

Find out more about Tidy at http://www.html-tidy.org"
  :type 'boolean
  :tag "Hermeneus — tidy entry source?"
  :group 'hermeneus)

(defcustom hrm-show-entry-source-tidy-config
  (expand-file-name "hrm-tidy.conf" (file-name-directory
                                     (locate-library "hermeneus")))
  "Configuration file to use with Tidy when tidying XML sources.
See options “Hermeneus — show entry source?” (‘hrm-show-entry-source-p’)
and “Hermeneus — tidy entry source?” (‘hrm-show-entry-source-tidy’).

Find out more about Tidy at http://www.html-tidy.org"
  :type 'file
  :tag "Hermeneus — Tidy config file"
  :group 'hermeneus)

(defun hrm--roman-numeral-p (string)
  "A limited test for whether STRING represents a Roman numeral.
This is to allow proper spacing for Roman-numbered list bullets.
The limitation is that it can’t tell when a single letter (“I”, “V”,
“X”, etc.) is supposed to be a Roman numeral or not, and in those
cases it will return nil."
  (when (> (length string) 1)
    (string-match-p "\\`M?M?M?C?M?D?C?C?C?D?C?X?C?L?X?L?X?X?X?I?X?V?I?V?I?I?I?\\'" string)))

(defun hrm--margin-indent-width ()
  (shr-string-pixel-width
   (propertize "XIII " :face 'hrm-default-face)))

(defun hrm--pixel-column ()
  (let ((pos (point)))
    (prog1 (shr-pixel-column)
      (goto-char pos))))
