hermeneus.org
*** Get entry source
:PROPERTIES:
:ID:       TKR:2e7d2ea0-72e2-4903-80ac-2ac3f2980f71
:END:
#+begin_src emacs-lisp
(cl-defun hrm--get-entry-source (&optional (obj hrm--word-obj))
  (seq-let (i begin end) (oref obj loc)
    (let ((bufstr (hrm--get-dom-from-file i begin end :plain-xml-p t)))
      (with-temp-buffer
        (insert bufstr)
        (hrm-tidy-xml-buffer)
        (hrm-indent-xml-buffer)
        ;; fontify the source—thanks go to Wilfred Hughes’s
        ;; ‘helpful’ package for a good example of how to do this
        ;; (in function ‘helpful--syntax-highlight’)
        (delay-mode-hooks
          (if (fboundp 'xml-mode)
              (nxml-mode)
            (xml-mode)))
        (if (fboundp 'font-lock-ensure)
            (font-lock-ensure)
          (with-no-warnings
            (font-lock-fontify-buffer)))
        (buffer-string)))))

;; (cl-defun hrm--get-entry-sexp (&optional (obj hrm--word-obj))
;;   (seq-let (i begin end) (oref obj loc)
;;     (let ((bufstr (hrm--get-dom-from-file i begin end)))
;;       (with-temp-buffer
;;         (pp bufstr (current-buffer))
;;         (delay-mode-hooks (emacs-lisp-mode))
;;         (when (fboundp 'rainbow-delimiters-mode)
;;           (rainbow-delimiters-mode))
;;         (if (fboundp 'font-lock-ensure)
;;             (font-lock-ensure)
;;           (with-no-warnings
;;             (font-lock-fontify-buffer)))
;;         (buffer-string)))))
#+end_src

*** Tidying
:PROPERTIES:
:ID:       TKR:4d3df8d9-777d-4421-ad3a-a10912a34890
:END:
#+begin_src emacs-lisp
(defun hrm-tidy-xml-buffer ()
  (interactive)
  (if (and hrm-show-entry-source-tidy-p (executable-find "tidy"))
      (call-process-region 1 (point-max) "tidy" t t nil
                           "-config" hrm-show-entry-source-tidy-config "-")))

(defun hrm-indent-xml-buffer ()
  (interactive)
  ;; Tidy and ‘nxml-mode’ both royally fail at
  ;; indenting the LSJ’s XML properly, so we’ll
  ;; press ‘sgml-mode’ into service.
  (when (fboundp 'sgml-mode)
    (let ((mode major-mode))
      (delay-mode-hooks (sgml-mode))
      (goto-char (point-min))
      (while (< (point) (point-max))
        (sgml-indent-line)
        (forward-line))
      (funcall mode))))
#+end_src

*** TODO Clear out old Hermeneus buffers
#+begin_src emacs-lisp
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:62892e62-3cf5-4ebb-8622-83ad6021d9d3
:END:
#+begin_src emacs-lisp
(provide 'hrm-render)

;; hrm-render.el ends here
#+end_src

* End matter
:PROPERTIES:
:ID:       TKR:ea04e9be-aeef-48ed-88eb-f885d3304129
:END:
#+begin_src emacs-lisp
(require 'hrm-conv)
(require 'hrm-match)
(require 'hrm-xml)
(require 'hrm-completion)
(require 'hrm-storage)
(require 'hrm-cts)
(require 'hrm-tags)
(require 'hrm-render)

(provide 'hermeneus)

;; hermeneus.el ends here
#+end_src
