hrm-render.el

(cl-defun hrm--get-entry-source (&optional (obj hrm--word-obj))
  (seq-let (i begin end) (oref obj loc)
    (let ((bufstr (hrm--get-dom-from-file i begin end :plain-xml-p t)))
      (with-temp-buffer
        (insert bufstr)
        (hrm-tidy-xml-buffer)
        (hrm-indent-xml-buffer)
        ;; fontify the source—thanks go to Wilfred Hughes’s
        ;; ‘helpful’ package for a good example of how to do this
        ;; (in function ‘helpful--syntax-highlight’)
        (delay-mode-hooks
          (if (fboundp 'xml-mode)
              (nxml-mode)
            (xml-mode)))
        (if (fboundp 'font-lock-ensure)
            (font-lock-ensure)
          (with-no-warnings
            (font-lock-fontify-buffer)))
        (buffer-string)))))

;; (cl-defun hrm--get-entry-sexp (&optional (obj hrm--word-obj))
;;   (seq-let (i begin end) (oref obj loc)
;;     (let ((bufstr (hrm--get-dom-from-file i begin end)))
;;       (with-temp-buffer
;;         (pp bufstr (current-buffer))
;;         (delay-mode-hooks (emacs-lisp-mode))
;;         (when (fboundp 'rainbow-delimiters-mode)
;;           (rainbow-delimiters-mode))
;;         (if (fboundp 'font-lock-ensure)
;;             (font-lock-ensure)
;;           (with-no-warnings
;;             (font-lock-fontify-buffer)))
;;         (buffer-string)))))

(defun hrm-tidy-xml-buffer ()
  (interactive)
  (if (and hrm-show-entry-source-tidy-p (executable-find "tidy"))
      (call-process-region 1 (point-max) "tidy" t t nil
                           "-config" hrm-show-entry-source-tidy-config "-")))

(defun hrm-indent-xml-buffer ()
  (interactive)
  ;; Tidy and ‘nxml-mode’ both royally fail at
  ;; indenting the LSJ’s XML properly, so we’ll
  ;; press ‘sgml-mode’ into service.
  (when (fboundp 'sgml-mode)
    (let ((mode major-mode))
      (delay-mode-hooks (sgml-mode))
      (goto-char (point-min))
      (while (< (point) (point-max))
        (sgml-indent-line)
        (forward-line))
      (funcall mode))))



(provide 'hrm-render)

;; hrm-render.el ends here
